
*** Dumping AST Record Layout
         0 | class std::exception
         0 |   (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::type_info
         0 |   (type_info vtable pointer)
         8 |   const char * __name
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_alloc
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__exception_ptr::exception_ptr
         0 |   void * _M_exception_object
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::nested_exception
         0 |   (nested_exception vtable pointer)
         8 |   class std::__exception_ptr::exception_ptr _M_ptr
         8 |     void * _M_exception_object
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_val (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Val_less_iter (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_val (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __locale_struct
         0 |   struct __locale_data *[13] __locales
       104 |   const unsigned short * __ctype_b
       112 |   const int * __ctype_tolower
       120 |   const int * __ctype_toupper
       128 |   const char *[13] __names
           | [sizeof=232, dsize=232, align=8,
           |  nvsize=232, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __va_list_tag
         0 |   unsigned int gp_offset
         4 |   unsigned int fp_offset
         8 |   void * overflow_arg_area
        16 |   void * reg_save_area
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (unnamed at /usr/include/pthread.h:501:3)
         0 |   __jmp_buf __cancel_jmp_buf
        64 |   int __mask_was_saved
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | union pthread_attr_t
         0 |   char[56] __size
         0 |   long __align
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutex_t
         0 |   struct __pthread_mutex_s __data
         0 |     int __lock
         4 |     unsigned int __count
         8 |     int __owner
        12 |     unsigned int __nusers
        16 |     int __kind
        20 |     short __spins
        22 |     short __elision
        24 |     struct __pthread_internal_list __list
        24 |       struct __pthread_internal_list * __prev
        32 |       struct __pthread_internal_list * __next
         0 |   char[40] __size
         0 |   long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutexattr_t
         0 |   char[4] __size
         0 |   int __align
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int[2] __g_refs
        24 |   unsigned int[2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int[2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_cond_t
         0 |   struct __pthread_cond_s __data
         0 |     union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17) 
         0 |       unsigned long long __wseq
         0 |       struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |         unsigned int __low
         4 |         unsigned int __high
         8 |     union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17) 
         8 |       unsigned long long __g1_start
         8 |       struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         8 |         unsigned int __low
        12 |         unsigned int __high
        16 |     unsigned int[2] __g_refs
        24 |     unsigned int[2] __g_size
        32 |     unsigned int __g1_orig_size
        36 |     unsigned int __wrefs
        40 |     unsigned int[2] __g_signals
         0 |   char[48] __size
         0 |   long long __align
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const volatile void *, const volatile void *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char>
         0 |   size_t _M_len
         8 |   const char * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<wchar_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<wchar_t>
         0 |   size_t _M_len
         8 |   const wchar_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char16_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char16_t>
         0 |   size_t _M_len
         8 |   const char16_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char32_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char32_t>
         0 |   size_t _M_len
         8 |   const char32_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::input_iterator_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::forward_iterator_tag (empty)
         0 |   struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::bidirectional_iterator_tag (empty)
         0 |   struct std::forward_iterator_tag (base) (empty)
         0 |     struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::random_access_iterator_tag (empty)
         0 |   struct std::bidirectional_iterator_tag (base) (empty)
         0 |     struct std::forward_iterator_tag (base) (empty)
         0 |       struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__false_type (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char> (empty)
         0 |   class __gnu_cxx::new_allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::_Alloc_hider
         0 |   class std::allocator<char> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char[16] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char>
         0 |   struct std::basic_string<char>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char[16] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<wchar_t> (empty)
         0 |   class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::_Alloc_hider
         0 |   class std::allocator<wchar_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   wchar_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<wchar_t>
         0 |   struct std::basic_string<wchar_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<wchar_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     wchar_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char16_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char16_t> (empty)
         0 |   class __gnu_cxx::new_allocator<char16_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::_Alloc_hider
         0 |   class std::allocator<char16_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char16_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char16_t[8] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char16_t>
         0 |   struct std::basic_string<char16_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char16_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char16_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char16_t[8] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char32_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char32_t> (empty)
         0 |   class __gnu_cxx::new_allocator<char32_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::_Alloc_hider
         0 |   class std::allocator<char32_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char32_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char32_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char32_t>
         0 |   struct std::basic_string<char32_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char32_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char32_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char32_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale
         0 |   _Impl * _M_impl
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::facet
         0 |   (facet vtable pointer)
         8 |   _Atomic_word _M_refcount
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::_Impl
         0 |   _Atomic_word _M_refcount
         8 |   const facet ** _M_facets
        16 |   size_t _M_facets_size
        24 |   const facet ** _M_caches
        32 |   char ** _M_names
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::id
         0 |   size_t _M_index
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const class std::error_category *> (empty)
         0 |   struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::error_category
         0 |   (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::error_code
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::error_condition
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5)
         0 |   const char * _M_p
         0 |   char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cow_string
         0 |   union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         0 |     const char * _M_p
         0 |     char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::runtime_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   struct std::__cow_string _M_msg
         8 |     union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         8 |       const char * _M_p
         8 |       char[8] _M_bytes
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::system_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     struct std::__cow_string _M_msg
         8 |       union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         8 |         const char * _M_p
         8 |         char[8] _M_bytes
        16 |   struct std::error_code _M_code
        16 |     int _M_value
        24 |     const error_category * _M_cat
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Words
         0 |   void * _M_pword
         8 |   long _M_iword
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base
         0 |   (ios_base vtable pointer)
         8 |   streamsize _M_precision
        16 |   streamsize _M_width
        24 |   fmtflags _M_flags
        28 |   iostate _M_exception
        32 |   iostate _M_streambuf_state
        40 |   _Callback_list * _M_callbacks
        48 |   struct std::ios_base::_Words _M_word_zero
        48 |     void * _M_pword
        56 |     long _M_iword
        64 |   _Words[8] _M_local_word
       192 |   int _M_word_size
       200 |   _Words * _M_word
       208 |   class std::locale _M_ios_locale
       208 |     _Impl * _M_impl
           | [sizeof=216, dsize=216, align=8,
           |  nvsize=216, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ctype_base (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ctype<char>
         0 |   class std::locale::facet (primary base)
         0 |     (facet vtable pointer)
         8 |     _Atomic_word _M_refcount
         0 |   struct std::ctype_base (base) (empty)
        16 |   __c_locale _M_c_locale_ctype
        24 |   _Bool _M_del
        32 |   __to_type _M_toupper
        40 |   __to_type _M_tolower
        48 |   const mask * _M_table
        56 |   char _M_widen_ok
        57 |   char[256] _M_widen
       313 |   char[256] _M_narrow
       569 |   char _M_narrow_ok
           | [sizeof=576, dsize=570, align=8,
           |  nvsize=570, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::allocator<char> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Callback_list
         0 |   _Callback_list * _M_next
         8 |   class ios_base::event_callback _M_fn
        16 |   int _M_index
        20 |   _Atomic_word _M_refcount
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ios<char>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     streamsize _M_precision
        16 |     streamsize _M_width
        24 |     fmtflags _M_flags
        28 |     iostate _M_exception
        32 |     iostate _M_streambuf_state
        40 |     _Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     _Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     _Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       _Impl * _M_impl
       216 |   basic_ostream<char, char_traits<char> > * _M_tie
       224 |   char_type _M_fill
       225 |   _Bool _M_fill_init
       232 |   basic_streambuf<char, char_traits<char> > * _M_streambuf
       240 |   const __ctype_type * _M_ctype
       248 |   const __num_put_type * _M_num_put
       256 |   const __num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   streamsize _M_gcount
        16 |   class std::basic_ios<char> (virtual base)
        16 |     class std::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       streamsize _M_precision
        32 |       streamsize _M_width
        40 |       fmtflags _M_flags
        44 |       iostate _M_exception
        48 |       iostate _M_streambuf_state
        56 |       _Callback_list * _M_callbacks
        64 |       struct std::ios_base::_Words _M_word_zero
        64 |         void * _M_pword
        72 |         long _M_iword
        80 |       _Words[8] _M_local_word
       208 |       int _M_word_size
       216 |       _Words * _M_word
       224 |       class std::locale _M_ios_locale
       224 |         _Impl * _M_impl
       232 |     basic_ostream<char, char_traits<char> > * _M_tie
       240 |     char_type _M_fill
       241 |     _Bool _M_fill_init
       248 |     basic_streambuf<char, char_traits<char> > * _M_streambuf
       256 |     const __ctype_type * _M_ctype
       264 |     const __num_put_type * _M_num_put
       272 |     const __num_get_type * _M_num_get
           | [sizeof=280, dsize=280, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ios<wchar_t>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     streamsize _M_precision
        16 |     streamsize _M_width
        24 |     fmtflags _M_flags
        28 |     iostate _M_exception
        32 |     iostate _M_streambuf_state
        40 |     _Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     _Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     _Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       _Impl * _M_impl
       216 |   basic_ostream<wchar_t, char_traits<wchar_t> > * _M_tie
       224 |   char_type _M_fill
       228 |   _Bool _M_fill_init
       232 |   basic_streambuf<wchar_t, char_traits<wchar_t> > * _M_streambuf
       240 |   const __ctype_type * _M_ctype
       248 |   const __num_put_type * _M_num_put
       256 |   const __num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_istream<wchar_t>
         0 |   (basic_istream vtable pointer)
         8 |   streamsize _M_gcount
        16 |   class std::basic_ios<wchar_t> (virtual base)
        16 |     class std::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       streamsize _M_precision
        32 |       streamsize _M_width
        40 |       fmtflags _M_flags
        44 |       iostate _M_exception
        48 |       iostate _M_streambuf_state
        56 |       _Callback_list * _M_callbacks
        64 |       struct std::ios_base::_Words _M_word_zero
        64 |         void * _M_pword
        72 |         long _M_iword
        80 |       _Words[8] _M_local_word
       208 |       int _M_word_size
       216 |       _Words * _M_word
       224 |       class std::locale _M_ios_locale
       224 |         _Impl * _M_impl
       232 |     basic_ostream<wchar_t, char_traits<wchar_t> > * _M_tie
       240 |     char_type _M_fill
       244 |     _Bool _M_fill_init
       248 |     basic_streambuf<wchar_t, char_traits<wchar_t> > * _M_streambuf
       256 |     const __ctype_type * _M_ctype
       264 |     const __num_put_type * _M_num_put
       272 |     const __num_get_type * _M_num_get
           | [sizeof=280, dsize=280, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base::Init (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x558829452618[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:626:5[0m, [0;33mline:641:5[0m> [0;33mline:626:11[0m referenced class[0;1;36m Init[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829452738[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x558829452820[0m <[0;33mline:628:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829452860[0m <[0;33mline:629:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294528f8[0m <[0;33mline:630:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m used[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x558829452a28[0m <[0;33mline:631:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m used[0;1;36m ~Init[0m [0;32m'void () noexcept'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829452ca0[0m <[0;33mline:634:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const Init &)'[0m default trivial noexcept-unevaluated 0x558829452ca0 implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452b98[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const Init &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829452ef8[0m <[0;33mline:635:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'Init &(const Init &)'[0m default trivial noexcept-unevaluated 0x558829452ef8 implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452d80[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const Init &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829452fa8[0m <[0;33mline:638:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829452fe0[0m <[0;33mline:639:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x558829453058[0m <[0;33mline:640:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base::Init" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::ios_base::Init.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::basic_ios<char> (virtual base)
         8 |     class std::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       streamsize _M_precision
        24 |       streamsize _M_width
        32 |       fmtflags _M_flags
        36 |       iostate _M_exception
        40 |       iostate _M_streambuf_state
        48 |       _Callback_list * _M_callbacks
        56 |       struct std::ios_base::_Words _M_word_zero
        56 |         void * _M_pword
        64 |         long _M_iword
        72 |       _Words[8] _M_local_word
       200 |       int _M_word_size
       208 |       _Words * _M_word
       216 |       class std::locale _M_ios_locale
       216 |         _Impl * _M_impl
       224 |     basic_ostream<char, char_traits<char> > * _M_tie
       232 |     char_type _M_fill
       233 |     _Bool _M_fill_init
       240 |     basic_streambuf<char, char_traits<char> > * _M_streambuf
       248 |     const __ctype_type * _M_ctype
       256 |     const __num_put_type * _M_num_put
       264 |     const __num_get_type * _M_num_get
           | [sizeof=272, dsize=272, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x558829451940[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:592:5[0m, [0;33mline:597:5[0m> [0;33mline:592:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829451a58[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451b00[0m <[0;33mline:594:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451b68[0m <[0;33mline:595:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829451c28[0m <[0;33mline:596:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m implicit-inline
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829451b00[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456b60[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456b20[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829451b68[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456bd8[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456b98[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456c20[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294552a0[0m <[0;33mline:592:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const _Words &)'[0m inline default trivial noexcept-unevaluated 0x5588294552a0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294553d0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294554b0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (_Words &&)'[0m inline default trivial noexcept-unevaluated 0x5588294554b0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294555e0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455660[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(const _Words &)'[0m inline default trivial noexcept-unevaluated 0x558829455660
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829455790[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455800[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(_Words &&)'[0m inline default trivial noexcept-unevaluated 0x558829455800
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829455930[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m`-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588295ab018[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::ios_base::_Words" = type { ptr, i64 }
  NonVirtualBaseLLVMType:%"struct.std::ios_base::_Words" = type { ptr, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c6630[0m prev 0x558828dd0f60 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:62:3[0m, [0;33mline:359:3[0m> [0;33mline:62:9[0m referenced class[0;1;36m locale[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c6728[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m locale[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588293c67b8[0m <[0;33mline:64:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588293c67f8[0m <[0;33mline:67:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m category[0m [0;32m'int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0a0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c6850[0m <[0;33mline:70:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m class[0;1;36m facet[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c6900[0m <[0;33mline:71:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m id[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c69b0[0m <[0;33mline:72:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m _Impl[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588293c6ab0[0m <[0;33mline:74:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class facet':'std::locale::facet'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588293c9670[0m <[0;33mline:75:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class _Impl':'std::locale::_Impl'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588293c9998[0m <[0;33mline:77:5[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588293c98b0[0m parent 0x5588293c6568 prev 0x558828dd1310 <[0;33mline:77:5[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m friend[0;1;36m has_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293c96b0[0m <[0;33mline:77:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x5588293c97f8[0m parent 0x5588293c6568 prev 0x558828dd1268 <[0;33mline:78:7[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m friend[0;1;36m has_facet[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293c9760[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x558828e510c0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x558828e52ca8[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958bbf8[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958c018[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958c598[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958cb18[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959f128[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959f548[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959fac8[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x5588295a0048[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const locale &) throw()'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588293c9d30[0m <[0;33mline:81:5[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588293c9c48[0m parent 0x5588293c6568 prev 0x558828dd1688 <[0;33mline:81:5[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m friend[0;1;36m use_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293c99d8[0m <[0;33mline:81:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x5588293c9b90[0m parent 0x5588293c6568 prev 0x558828dd15e0 <[0;33mline:82:7[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m friend[0;1;36m use_facet[0m [0;32m'const _Facet &(const locale &)'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293c9a90[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x558828e50c20[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x558828e52880[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x558829589d80[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958a470[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958ae20[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882958b7d0[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<char> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959c840[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959cf30[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<wchar_t> &(const locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x55882959d8e0[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<wchar_t> &(const locale &)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x55882959ed00[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<wchar_t> &(const locale &)'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588293ca0c0[0m <[0;33mline:85:5[0m, [0;33mline:86:21[0m> [0;33mcol:21[0m
[0;34m| `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x5588293c9e98[0m parent 0x5588293c6568 <[0;33mline:85:5[0m, [0;33mline:86:21[0m> [0;33mcol:21[0m friend_undeclared[0;1;36m __use_cache[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293c9d70[0m <[0;33mline:85:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Cache[0m
[0;34m|   `-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588293c9e08[0m parent 0x5588293c6568 <[0;33mline:86:14[0m, [0;33mcol:21[0m> [0;33mcol:21[0m struct[0;1;36m __use_cache[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca190[0m <[0;33mline:98:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m none[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca1f8[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca280[0m <[0;33mline:99:5[0m, [0;33mcol:42[0m> [0;33mcol:27[0m referenced[0;1;36m ctype[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca348[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca328[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca2e8[0m <[0;33mcol:36[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca308[0m <[0;33mcol:42[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca3c8[0m <[0;33mline:100:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m numeric[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca490[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca470[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca430[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca450[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca510[0m <[0;33mline:101:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m collate[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca5d8[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca5b8[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca578[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca598[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca658[0m <[0;33mline:102:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m time[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca720[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca700[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca6c0[0m <[0;33mcol:35[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca6e0[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 3[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca7a0[0m <[0;33mline:103:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m monetary[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca868[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca848[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca808[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca828[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ca8e8[0m <[0;33mline:104:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m messages[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ca9b0[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293ca990[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca950[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293ca970[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 5[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293caa30[0m <[0;33mline:105:5[0m, [0;33mline:106:36[0m> [0;33mline:105:27[0m[0;1;36m all[0m [0;32m'const category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mParenExpr[0m[0;33m 0x5588293cad90[0m <[0;33mcol:34[0m, [0;33mline:106:36[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cad70[0m <[0;33mline:105:35[0m, [0;33mline:106:28[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cacf8[0m <[0;33mline:105:35[0m, [0;33mline:106:17[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cac80[0m <[0;33mline:105:35[0m, [0;33mline:106:9[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cac08[0m <[0;33mline:105:35[0m, [0;33mcol:53[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cab90[0m <[0;33mcol:35[0m, [0;33mcol:43[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cab40[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cab20[0m <[0;33mcol:35[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca280[0m[0;1;36m 'ctype'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cab78[0m <[0;33mcol:43[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cab58[0m <[0;33mcol:43[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca3c8[0m[0;1;36m 'numeric'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cabf0[0m <[0;33mcol:53[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cabd0[0m <[0;33mcol:53[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca510[0m[0;1;36m 'collate'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cac68[0m <[0;33mline:106:9[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cac48[0m <[0;33mcol:9[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca658[0m[0;1;36m 'time'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cace0[0m <[0;33mcol:17[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cacc0[0m <[0;33mcol:17[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca7a0[0m[0;1;36m 'monetary'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cad58[0m <[0;33mcol:28[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cad38[0m <[0;33mcol:28[0m> [0;32m'const category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588293ca8e8[0m[0;1;36m 'messages'[0m [0;32m'const category':'const int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cae80[0m <[0;33mline:117:5[0m, [0;33mcol:20[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cb058[0m <[0;33mline:126:5[0m, [0;33mcol:41[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293caf48[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cb1c8[0m <[0;33mline:136:5[0m, [0;33mline:137:27[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const char *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb138[0m <[0;33mcol:12[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cb4e0[0m <[0;33mline:151:5[0m, [0;33mcol:65[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const locale &, const char *, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb2a8[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb328[0m <[0;33mcol:34[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb3a0[0m <[0;33mcol:51[0m, [0;33mcol:60[0m> [0;33mcol:60[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cb750[0m <[0;33mline:162:5[0m, [0;33mline:163:60[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const std::string &)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb688[0m <[0;33mcol:12[0m, [0;33mcol:31[0m> [0;33mcol:31[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'locale':'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x5588293ce968[0m <[0;33mcol:38[0m, [0;33mcol:56[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const char *)'[0m
[0;34m| |   `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x5588293ce798[0m <[0;33mcol:45[0m, [0;33mcol:55[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x5588293ce768[0m <[0;33mcol:45[0m, [0;33mcol:49[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x5588291cd198[0m
[0;34m| |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293ce748[0m <[0;33mcol:45[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588293cb688[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588293ce9c0[0m <[0;33mcol:58[0m, [0;33mcol:60[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cbaa0[0m <[0;33mline:177:5[0m, [0;33mline:178:44[0m> [0;33mline:177:5[0m[0;1;36m locale[0m [0;32m'void (const locale &, const std::string &, category)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb830[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb8f0[0m <[0;33mcol:34[0m, [0;33mcol:53[0m> [0;33mcol:53[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cb968[0m <[0;33mcol:58[0m, [0;33mcol:67[0m> [0;33mcol:67[0m used[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'locale':'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x5588293ceb28[0m <[0;33mline:178:7[0m, [0;33mcol:40[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const locale &, const char *, category)'[0m
[0;34m| |   |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293ce9d0[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588293cb830[0m[0;1;36m '__base'[0m [0;32m'const locale &'[0m
[0;34m| |   |-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x5588293cea40[0m <[0;33mcol:22[0m, [0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |   | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x5588293cea10[0m <[0;33mcol:22[0m, [0;33mcol:26[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x5588291cd198[0m
[0;34m| |   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293ce9f0[0m <[0;33mcol:22[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588293cb8f0[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293ceb10[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cea60[0m <[0;33mcol:35[0m> [0;32m'category':'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588293cb968[0m[0;1;36m '__cat'[0m [0;32m'category':'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588293ceb90[0m <[0;33mcol:42[0m, [0;33mcol:44[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cbdc0[0m <[0;33mline:192:5[0m, [0;33mcol:69[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const locale &, const locale &, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cbb90[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cbc10[0m <[0;33mcol:34[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __add[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cbc88[0m <[0;33mcol:55[0m, [0;33mcol:64[0m> [0;33mcol:64[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588293cc1d0[0m <[0;33mline:205:5[0m, [0;33mline:206:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293cbe98[0m <[0;33mline:205:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cc120[0m <[0;33mline:206:7[0m, [0;33mcol:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m [0;32m'void (const locale &, _Facet *)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cbf50[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cc000[0m <[0;33mcol:37[0m, [0;33mcol:45[0m> [0;33mcol:45[0m[0;1;36m __f[0m [0;32m'_Facet *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588293cc298[0m <[0;33mline:209:5[0m, [0;33mcol:21[0m> [0;33mcol:5[0m used[0;1;36m ~locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cc480[0m <[0;33mline:219:5[0m, [0;33mline:220:44[0m> [0;33mcol:5[0m referenced[0;1;36m operator=[0m [0;32m'const locale &(const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cc368[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588293cc7c8[0m <[0;33mline:234:5[0m, [0;33mline:236:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293cc530[0m <[0;33mline:234:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cc720[0m <[0;33mline:235:7[0m, [0;33mline:236:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m [0;32m'locale (const locale &) const'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cc5e0[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cc8d0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h:110:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:245:12[0m> [0;33mcol:5[0m[0;1;36m name[0m [0;32m'string () const'[0m
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x5588293cc978[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h:110:47[0m, [0;33mcol:67[0m> cxx11
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293ccb28[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:254:5[0m, [0;33mline:255:51[0m> [0;33mcol:5[0m used[0;1;36m operator==[0m [0;32m'bool (const locale &) const throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cca10[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293ccc88[0m <[0;33mline:264:5[0m, [0;33mline:266:44[0m> [0;33mline:265:5[0m[0;1;36m operator!=[0m [0;32m'bool (const locale &) const throw()'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293ccbf0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m used[0;1;36m __other[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588293cec70[0m <[0;33mline:266:5[0m, [0;33mcol:44[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x5588293cec60[0m <[0;33mcol:7[0m, [0;33mcol:41[0m>
[0;34m|     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x5588293cec48[0m <[0;33mcol:14[0m, [0;33mcol:41[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m prefix '!' cannot overflow
[0;34m|       `-[0m[0;1;35mParenExpr[0m[0;33m 0x5588293cec28[0m <[0;33mcol:15[0m, [0;33mcol:41[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|         `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x5588293cec00[0m <[0;33mcol:16[0m, [0;33mcol:40[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|           |-[0m[0;1;35mMemberExpr[0m[0;33m 0x5588293cebb0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->operator==[0;33m 0x5588293ccb28[0m
[0;34m|           | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x5588293ceba0[0m <[0;33mcol:16[0m> [0;32m'const std::locale *'[0m[0;36m[0m[0;36m[0m this
[0;34m|           `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588293cebe0[0m <[0;33mcol:33[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588293ccbf0[0m[0;1;36m '__other'[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588293cd408[0m <[0;33mline:284:5[0m, [0;33mline:287:54[0m> [0;33mline:286:7[0m[0;1;36m operator()[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293ccd38[0m <[0;33mline:284:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Char[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293ccdc0[0m <[0;33mcol:30[0m, [0;33mcol:39[0m> [0;33mcol:39[0m referenced typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588293cce40[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;33mcol:57[0m referenced typename depth 0 index 2[0;1;36m _Alloc[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cd360[0m <[0;33mline:285:7[0m, [0;33mline:287:54[0m> [0;33mline:286:7[0m[0;1;36m operator()[0m [0;32m'bool (const basic_string<_Char, _Traits, _Alloc> &, const basic_string<_Char, _Traits, _Alloc> &) const'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cd068[0m <[0;33mcol:18[0m, [0;33mcol:62[0m> [0;33mcol:62[0m[0;1;36m __s1[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cd248[0m <[0;33mline:287:4[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __s2[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cd590[0m <[0;33mline:300:5[0m, [0;33mline:301:31[0m> [0;33mcol:5[0m[0;1;36m global[0m [0;32m'locale (const locale &)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cd488[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cd6c8[0m <[0;33mline:306:5[0m, [0;33mline:307:13[0m> [0;33mcol:5[0m[0;1;36m classic[0m [0;32m'const locale &()'[0m static
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588293cd770[0m <[0;33mline:309:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588293cd848[0m <[0;33mline:311:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_impl[0m [0;32m'_Impl *'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293cd8b0[0m <[0;33mline:314:5[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m _S_classic[0m [0;32m'_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293cd930[0m <[0;33mline:317:5[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m _S_global[0m [0;32m'_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293cd9b0[0m <[0;33mline:323:5[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m _S_categories[0m [0;32m'const char *const *const'[0m static
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x5588293cda18[0m <[0;33mline:335:5[0m, [0;33mcol:61[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x5588293cdb60[0m <[0;33mcol:12[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++locale.h:45:33[0m> [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:335:12[0m referenced[0;1;36m _S_categories_size[0m [0;32m'std::locale::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:335:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588293cdbb8[0m <[0;33mcol:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++locale.h:45:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x5588293cdb40[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:335:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m12[0m[0m
[0;34m|       `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x5588293cdb20[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:335:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '+'
[0;34m|         |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293cdae0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:335:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|         `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588293cdb00[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293cdbe0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/locale_classes.h:338:5[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m _S_once[0m [0;32m'__gthread_once_t':'int'[0m static
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588293cdd78[0m <[0;33mline:341:5[0m, [0;33mline:342:26[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void (_Impl *) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cdc60[0m <[0;33mcol:12[0m, [0;33mcol:17[0m> [0;33mcol:18[0m [0;32m'_Impl *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cde60[0m <[0;33mline:344:5[0m, [0;33mline:345:19[0m> [0;33mcol:5[0m[0;1;36m _S_initialize[0m [0;32m'void ()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293cdf30[0m <[0;33mline:347:5[0m, [0;33mline:348:32[0m> [0;33mcol:5[0m[0;1;36m _S_initialize_once[0m [0;32m'void () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293ce0b0[0m <[0;33mline:350:5[0m, [0;33mline:351:35[0m> [0;33mcol:5[0m[0;1;36m _S_normalize_category[0m [0;32m'category (category)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293cdfe8[0m <[0;33mcol:27[0m> [0;33mcol:35[0m [0;32m'category':'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588293ce310[0m <[0;33mline:353:5[0m, [0;33mline:354:74[0m> [0;33mcol:5[0m[0;1;36m _M_coalesce[0m [0;32m'void (const locale &, const locale &, category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293ce178[0m <[0;33mcol:17[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __base[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293ce1f8[0m <[0;33mcol:39[0m, [0;33mcol:53[0m> [0;33mcol:53[0m[0;1;36m __add[0m [0;32m'const locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588293ce270[0m <[0;33mcol:60[0m, [0;33mcol:69[0m> [0;33mcol:69[0m[0;1;36m __cat[0m [0;32m'category':'int'[0m
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x5588293ce4e8[0m <[0;33mline:357:5[0m, [0;33mcol:46[0m> [0;33mcol:28[0m[0;1;36m _S_twinned_facets[0m [0;32m'const id *const[]'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::locale" = type { ptr }
  NonVirtualBaseLLVMType:%"class.std::locale" = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x558829447690[0m prev 0x558828a1c340 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:228:3[0m, [0;33mline:903:3[0m> [0;33mline:228:9[0m referenced class[0;1;36m ios_base[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829447788[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m ios_base[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829447818[0m <[0;33mline:246:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829447860[0m <[0;33mline:255:5[0m, [0;33mline:274:5[0m> [0;33mline:255:34[0m class[0;1;36m failure[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m| |-[0mpublic [0;32m'system_error':'std::system_error'[0m
[0;34m| |-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x558829447978[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h:110:47[0m, [0;33mcol:67[0m> cxx11
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829447a38[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:255:5[0m, [0;33mcol:34[0m> [0;33mcol:34[0m implicit referenced class[0;1;36m failure[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829447ac8[0m <[0;33mline:257:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829447be0[0m <[0;33mline:258:7[0m, [0;33mline:259:34[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const string &)'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829447b08[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __str[0m [0;32m'const string &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829447e50[0m <[0;33mline:262:7[0m, [0;33mline:263:47[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const string &, const error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829447cb0[0m <[0;33mcol:15[0m, [0;33mcol:27[0m> [0;33mcol:28[0m [0;32m'const string &'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829447d30[0m <[0;33mcol:30[0m, [0;33mcol:46[0m> [0;33mcol:47[0m [0;32m'const error_code &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294480d0[0m <[0;33mline:265:7[0m, [0;33mline:266:63[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const char *, const error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829447f38[0m <[0;33mcol:15[0m, [0;33mcol:25[0m> [0;33mcol:26[0m [0;32m'const char *'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829447fb8[0m <[0;33mcol:28[0m, [0;33mcol:57[0m> [0;33mcol:46[0m [0;32m'const error_code &'[0m cinit
[0;34m| |   `-[0m[0;1;35mExprWithCleanups[0m[0;33m 0x5588294563b8[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMaterializeTemporaryExpr[0m[0;33m 0x5588294563a0[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |       `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x558829456370[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const error_code':'const std::error_code'[0m[0;36m[0m[0;36m[0m [0;32m'void (std::io_errc) noexcept'[0m
[0;34m| |         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829455a00[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'std::io_errc'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829446b00[0m[0;1;36m 'stream'[0m [0;32m'std::io_errc'[0m
[0;34m| |           `-[0mNestedNameSpecifier TypeSpec [0;32m'std::io_errc'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x558829448220[0m <[0;33mline:269:7[0m, [0;33mline:270:24[0m> [0;33mcol:7[0m[0;1;36m ~failure[0m [0;32m'void () throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x5588294205a8 system_error::~system_error 'void () noexcept' ]
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829448370[0m <[0;33mline:272:7[0m, [0;33mline:273:26[0m> [0;33mcol:7[0m[0;1;36m what[0m [0;32m'const char *() const throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x5588293fb6b0 runtime_error::what 'const char *() const noexcept' ]
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829448480[0m <[0;33mline:255:34[0m> [0;33mcol:34[0m implicit[0;1;36m failure[0m [0;32m'void (const failure &)'[0m inline default noexcept-unevaluated 0x558829448480
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294485b0[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const failure &'[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829448660[0m <[0;33mcol:34[0m> [0;33mcol:34[0m implicit[0;1;36m operator=[0m [0;32m'failure &(const failure &)'[0m inline default noexcept-unevaluated 0x558829448660
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829448790[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const failure &'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x558829448810[0m <[0;33mline:341:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m fmtflags[0m [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x55882942c590[0m [0;32m'_Ios_Fmtflags'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x55882942b1d0[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x55882942b130[0m[0;1;36m '_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294488e0[0m <[0;33mline:344:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m boolalpha[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448948[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b270[0m[0;1;36m '_S_boolalpha'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294489d0[0m <[0;33mline:347:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m dec[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448a38[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b348[0m[0;1;36m '_S_dec'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448ac0[0m <[0;33mline:350:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m fixed[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448b28[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b420[0m[0;1;36m '_S_fixed'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448bb0[0m <[0;33mline:353:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m hex[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448c18[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b4f8[0m[0;1;36m '_S_hex'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448ca0[0m <[0;33mline:358:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m internal[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448d08[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b5d0[0m[0;1;36m '_S_internal'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448d90[0m <[0;33mline:362:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m left[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448df8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b6a8[0m[0;1;36m '_S_left'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448e80[0m <[0;33mline:365:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m oct[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448ee8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b780[0m[0;1;36m '_S_oct'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829448f70[0m <[0;33mline:369:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m right[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829448fd8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b858[0m[0;1;36m '_S_right'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449060[0m <[0;33mline:372:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m scientific[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294490c8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942b930[0m[0;1;36m '_S_scientific'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449150[0m <[0;33mline:376:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showbase[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294491b8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942ba08[0m[0;1;36m '_S_showbase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449240[0m <[0;33mline:380:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpoint[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294492a8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942bae0[0m[0;1;36m '_S_showpoint'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449330[0m <[0;33mline:383:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpos[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449398[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942bbb8[0m[0;1;36m '_S_showpos'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449420[0m <[0;33mline:386:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m skipws[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449488[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942bc90[0m[0;1;36m '_S_skipws'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449510[0m <[0;33mline:389:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m unitbuf[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449578[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942bd68[0m[0;1;36m '_S_unitbuf'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449600[0m <[0;33mline:393:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m uppercase[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449668[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942be40[0m[0;1;36m '_S_uppercase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294496f0[0m <[0;33mline:396:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m adjustfield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449758[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942bf58[0m[0;1;36m '_S_adjustfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294497e0[0m <[0;33mline:399:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m basefield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449848[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942c070[0m[0;1;36m '_S_basefield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294498d0[0m <[0;33mline:402:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m floatfield[0m [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449938[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x55882942c148[0m[0;1;36m '_S_floatfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588294499c0[0m <[0;33mline:416:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m iostate[0m [0;32m'_Ios_Iostate':'std::_Ios_Iostate'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x558829444c00[0m [0;32m'_Ios_Iostate'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x558829444640[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x5588294445a0[0m[0;1;36m '_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449a90[0m <[0;33mline:420:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m badbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449af8[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829444778[0m[0;1;36m '_S_badbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449b80[0m <[0;33mline:423:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m eofbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449be8[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829444850[0m[0;1;36m '_S_eofbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449c70[0m <[0;33mline:428:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m failbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449cd8[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829444928[0m[0;1;36m '_S_failbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449d60[0m <[0;33mline:431:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m goodbit[0m [0;32m'const iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449dc8[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x5588294446a0[0m[0;1;36m '_S_goodbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x558829449e50[0m <[0;33mline:447:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m openmode[0m [0;32m'_Ios_Openmode':'std::_Ios_Openmode'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x558829442b60[0m [0;32m'_Ios_Openmode'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x558829442360[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x5588294422c0[0m[0;1;36m '_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829449f20[0m <[0;33mline:450:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m app[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829449f88[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829442400[0m[0;1;36m '_S_app'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944a010[0m <[0;33mline:453:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m ate[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944a078[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x5588294424d8[0m[0;1;36m '_S_ate'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944a100[0m <[0;33mline:458:5[0m, [0;33mcol:36[0m> [0;33mcol:27[0m[0;1;36m binary[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944a168[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x5588294425b0[0m[0;1;36m '_S_bin'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944fac0[0m <[0;33mline:461:5[0m, [0;33mcol:33[0m> [0;33mcol:27[0m referenced[0;1;36m in[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944fb28[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829442688[0m[0;1;36m '_S_in'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944fbb0[0m <[0;33mline:464:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m referenced[0;1;36m out[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944fc18[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829442760[0m[0;1;36m '_S_out'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944fca0[0m <[0;33mline:467:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m trunc[0m [0;32m'const openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944fd08[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829442838[0m[0;1;36m '_S_trunc'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x55882944fdc0[0m <[0;33mline:479:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m seekdir[0m [0;32m'_Ios_Seekdir':'std::_Ios_Seekdir'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x55882944fd80[0m [0;32m'_Ios_Seekdir'[0m sugar
[0;34m|   `-[0m[0;32mEnumType[0m[0;33m 0x5588294466e0[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|     `-[0m[0;1;32mEnum[0m[0;33m 0x558829446640[0m[0;1;36m '_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944fe90[0m <[0;33mline:482:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m beg[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944fef8[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829446740[0m[0;1;36m '_S_beg'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55882944ff80[0m <[0;33mline:485:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m referenced[0;1;36m cur[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882944ffe8[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x5588294467d8[0m[0;1;36m '_S_cur'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x558829450070[0m <[0;33mline:488:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m end[0m [0;32m'const seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294500d8[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x558829446870[0m[0;1;36m '_S_end'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x558829450150[0m <[0;33mline:512:5[0m, [0;33mline:517:5[0m> [0;33mline:512:10[0m referenced[0;1;36m event[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x558829450210[0m <[0;33mline:514:7[0m> [0;33mcol:7[0m referenced[0;1;36m erase_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x558829450268[0m <[0;33mline:515:7[0m> [0;33mcol:7[0m[0;1;36m imbue_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x5588294502c0[0m <[0;33mline:516:7[0m> [0;33mcol:7[0m referenced[0;1;36m copyfmt_event[0m [0;32m'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588294506d8[0m <[0;33mline:529:5[0m, [0;33mcol:70[0m> [0;33mcol:20[0m referenced[0;1;36m event_callback[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;32mPointerType[0m[0;33m 0x558829450660[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m|   `-[0m[0;32mParenType[0m[0;33m 0x558829450600[0m [0;32m'void (event, ios_base &, int)'[0m sugar
[0;34m|     `-[0m[0;32mFunctionProtoType[0m[0;33m 0x5588294505b0[0m [0;32m'void (event, ios_base &, int)'[0m cdecl
[0;34m|       |-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f000[0m [0;32m'void'[0m
[0;34m|       |-[0m[0;32mElaboratedType[0m[0;33m 0x558829450320[0m [0;32m'event'[0m sugar
[0;34m|       | `-[0m[0;32mEnumType[0m[0;33m 0x5588294501f0[0m [0;32m'std::ios_base::event'[0m
[0;34m|       |   `-[0m[0;1;32mEnum[0m[0;33m 0x558829450150[0m[0;1;36m 'event'[0m
[0;34m|       |-[0m[0;32mLValueReferenceType[0m[0;33m 0x558829450430[0m [0;32m'ios_base &'[0m
[0;34m|       | `-[0m[0;32mElaboratedType[0m[0;33m 0x5588294503d0[0m [0;32m'ios_base'[0m sugar
[0;34m|       |   `-[0m[0;32mRecordType[0m[0;33m 0x558828a1c3d0[0m [0;32m'std::ios_base'[0m
[0;34m|       |     `-[0m[0;1;32mCXXRecord[0m[0;33m 0x558829447690[0m[0;1;36m 'ios_base'[0m
[0;34m|       `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0a0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829450970[0m <[0;33mline:541:5[0m, [0;33mline:542:55[0m> [0;33mcol:5[0m[0;1;36m register_callback[0m [0;32m'void (event_callback, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294507a0[0m <[0;33mcol:23[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __fn[0m [0;32m'event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829450820[0m <[0;33mcol:44[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829450a28[0m <[0;33mline:544:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450a60[0m <[0;33mline:545:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_precision[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450ac0[0m <[0;33mline:546:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_width[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450b20[0m <[0;33mline:547:5[0m, [0;33mcol:15[0m> [0;33mcol:15[0m referenced[0;1;36m _M_flags[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450b80[0m <[0;33mline:548:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_exception[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450be0[0m <[0;33mline:549:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_streambuf_state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829450c30[0m <[0;33mline:553:5[0m, [0;33mline:581:5[0m> [0;33mline:553:12[0m referenced struct[0;1;36m _Callback_list[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial needs_implicit
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial needs_implicit
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial needs_implicit
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829450d48[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Callback_list[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450e88[0m <[0;33mline:556:7[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m _M_next[0m [0;32m'_Callback_list *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450f80[0m <[0;33mline:557:7[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m _M_fn[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829450fe8[0m <[0;33mline:558:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_index[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451048[0m <[0;33mline:559:7[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829451340[0m <[0;33mline:561:7[0m, [0;33mline:563:73[0m> [0;33mline:561:7[0m[0;1;36m _Callback_list[0m [0;32m'void (ios_base::event_callback, int, _Callback_list *)'[0m implicit-inline
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294510f0[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;33mcol:47[0m used[0;1;36m __fn[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829451170[0m <[0;33mcol:53[0m, [0;33mcol:57[0m> [0;33mcol:57[0m used[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294511f0[0m <[0;33mline:562:8[0m, [0;33mcol:24[0m> [0;33mcol:24[0m used[0;1;36m __cb[0m [0;32m'_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829450e88[0m[0;1;36m '_M_next'[0m [0;32m'_Callback_list *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456518[0m <[0;33mline:563:17[0m> [0;32m'_Callback_list *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294564d8[0m <[0;33mcol:17[0m> [0;32m'_Callback_list *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294511f0[0m[0;1;36m '__cb'[0m [0;32m'_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829450f80[0m[0;1;36m '_M_fn'[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456590[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829456550[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294510f0[0m[0;1;36m '__fn'[0m [0;32m'ios_base::event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829450fe8[0m[0;1;36m '_M_index'[0m [0;32m'int'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456608[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294565c8[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829451170[0m[0;1;36m '__index'[0m [0;32m'int'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829451048[0m[0;1;36m '_M_refcount'[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456640[0m <[0;33mcol:68[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588294566c0[0m <[0;33mcol:71[0m, [0;33mcol:73[0m>
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829451428[0m <[0;33mline:565:7[0m, [0;33mline:566:79[0m> [0;33mcol:7[0m referenced[0;1;36m _M_add_reference[0m [0;32m'void ()'[0m implicit-inline
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456810[0m <[0;33mcol:26[0m, [0;33mcol:79[0m>
[0;34m| |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x5588294567e0[0m <[0;33mcol:28[0m, [0;33mcol:76[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m| |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588294567c8[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829456720[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x558828e81288[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m| |     |   `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x558829174430[0m[0;1;36m '__gnu_cxx'[0m
[0;34m| |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x558829456790[0m <[0;33mcol:61[0m, [0;33mcol:62[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m| |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456760[0m <[0;33mcol:62[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x558829451048[0m
[0;34m| |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456750[0m <[0;33mcol:62[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x5588294567a8[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294514f8[0m <[0;33mline:569:7[0m, [0;33mline:580:7[0m> [0;33mline:570:7[0m[0;1;36m _M_remove_reference[0m [0;32m'int ()'[0m implicit-inline
[0;34m|   `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456af0[0m <[0;33mline:571:7[0m, [0;33mline:580:7[0m>
[0;34m|     |-[0m[0;1;35mNullStmt[0m[0;33m 0x558829456828[0m <[0;33mline:573:62[0m>
[0;34m|     |-[0m[0;1;35mDeclStmt[0m[0;33m 0x5588294569d8[0m <[0;33mline:574:9[0m, [0;33mcol:77[0m>
[0;34m|     | `-[0m[0;1;32mVarDecl[0m[0;33m 0x558829456848[0m <[0;33mcol:9[0m, [0;33mcol:76[0m> [0;33mcol:13[0m used[0;1;36m __res[0m [0;32m'int'[0m cinit
[0;34m|     |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x5588294569a8[0m <[0;33mcol:21[0m, [0;33mcol:76[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|     |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456990[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294568d0[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x558828e80c10[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m|     |     |   `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x558829174430[0m[0;1;36m '__gnu_cxx'[0m
[0;34m|     |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x558829456940[0m <[0;33mcol:60[0m, [0;33mcol:61[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456910[0m <[0;33mcol:61[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x558829451048[0m
[0;34m|     |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456900[0m <[0;33mcol:61[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     |     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x558829456978[0m <[0;33mcol:74[0m, [0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m|     |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456958[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     |-[0m[0;1;35mIfStmt[0m[0;33m 0x558829456a88[0m <[0;33mline:575:9[0m, [0;33mline:578:11[0m>
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x558829456a48[0m <[0;33mline:575:13[0m, [0;33mcol:22[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456a30[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294569f0[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x558829456848[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|     | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456a10[0m <[0;33mcol:22[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|     | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456a70[0m <[0;33mline:576:11[0m, [0;33mline:578:11[0m>
[0;34m|     |   `-[0m[0;1;35mNullStmt[0m[0;33m 0x558829456a68[0m <[0;33mline:577:65[0m>
[0;34m|     `-[0m[0;1;35mReturnStmt[0m[0;33m 0x558829456ae0[0m <[0;33mline:579:9[0m, [0;33mcol:16[0m>
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456ac8[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829456aa8[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x558829456848[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588294515d0[0m <[0;33mline:583:6[0m, [0;33mcol:22[0m> [0;33mcol:22[0m referenced[0;1;36m _M_callbacks[0m [0;32m'_Callback_list *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829451748[0m <[0;33mline:585:5[0m, [0;33mline:586:41[0m> [0;33mcol:5[0m referenced[0;1;36m _M_call_callbacks[0m [0;32m'void (event) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829451630[0m <[0;33mcol:23[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __ev[0m [0;32m'event':'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829451898[0m <[0;33mline:588:5[0m, [0;33mline:589:38[0m> [0;33mcol:5[0m referenced[0;1;36m _M_dispose_callbacks[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829451940[0m <[0;33mline:592:5[0m, [0;33mline:597:5[0m> [0;33mline:592:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829451a58[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451b00[0m <[0;33mline:594:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451b68[0m <[0;33mline:595:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829451c28[0m <[0;33mline:596:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m implicit-inline
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829451b00[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456b60[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456b20[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x558829451b68[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456bd8[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829456b98[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456c20[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294552a0[0m <[0;33mline:592:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const _Words &)'[0m inline default trivial noexcept-unevaluated 0x5588294552a0
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294553d0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294554b0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (_Words &&)'[0m inline default trivial noexcept-unevaluated 0x5588294554b0
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294555e0[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455660[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(const _Words &)'[0m inline default trivial noexcept-unevaluated 0x558829455660
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829455790[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const _Words &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455800[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'_Words &(_Words &&)'[0m inline default trivial noexcept-unevaluated 0x558829455800
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829455930[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'_Words &&'[0m
[0;34m| `-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588295ab018[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829451d30[0m <[0;33mline:600:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_word_zero[0m [0;32m'_Words':'std::ios_base::_Words'[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x558829451d80[0m <[0;33mline:604:5[0m, [0;33mcol:35[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x558829451e80[0m <[0;33mcol:12[0m, [0;33mcol:33[0m> [0;33mcol:12[0m referenced[0;1;36m _S_local_word_size[0m [0;32m'std::ios_base::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:604:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829451ed8[0m <[0;33mcol:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x558829451e60[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m8[0m[0m
[0;34m|       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x558829451e40[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588294520a0[0m <[0;33mline:605:5[0m, [0;33mcol:45[0m> [0;33mcol:13[0m referenced[0;1;36m _M_local_word[0m [0;32m'_Words[8]'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x558829452108[0m <[0;33mline:608:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced[0;1;36m _M_word_size[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588294521a8[0m <[0;33mline:609:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_word[0m [0;32m'_Words *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829452408[0m <[0;33mline:611:5[0m, [0;33mline:612:44[0m> [0;33mcol:5[0m used[0;1;36m _M_grow_words[0m [0;32m'_Words &(int, bool)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452210[0m <[0;33mcol:19[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452288[0m <[0;33mcol:32[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __iword[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588294524d0[0m <[0;33mline:615:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_ios_locale[0m [0;32m'locale':'std::locale'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829452548[0m <[0;33mline:617:5[0m, [0;33mline:618:21[0m> [0;33mcol:5[0m referenced[0;1;36m _M_init[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588294525f0[0m <[0;33mline:620:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829452618[0m <[0;33mline:626:5[0m, [0;33mline:641:5[0m> [0;33mline:626:11[0m referenced class[0;1;36m Init[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x558829452738[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m| |-[0m[0;1;32mFriendDecl[0m[0;33m 0x558829452820[0m <[0;33mline:628:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829452860[0m <[0;33mline:629:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294528f8[0m <[0;33mline:630:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m used[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x558829452a28[0m <[0;33mline:631:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m used[0;1;36m ~Init[0m [0;32m'void () noexcept'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829452ca0[0m <[0;33mline:634:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const Init &)'[0m default trivial noexcept-unevaluated 0x558829452ca0 implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452b98[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const Init &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829452ef8[0m <[0;33mline:635:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'Init &(const Init &)'[0m default trivial noexcept-unevaluated 0x558829452ef8 implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829452d80[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const Init &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829452fa8[0m <[0;33mline:638:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m| |-[0m[0;1;32mVarDecl[0m[0;33m 0x558829452fe0[0m <[0;33mline:639:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m| `-[0m[0;1;32mVarDecl[0m[0;33m 0x558829453058[0m <[0;33mline:640:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294531f0[0m <[0;33mline:648:5[0m, [0;33mline:650:24[0m> [0;33mline:649:5[0m referenced[0;1;36m flags[0m [0;32m'fmtflags () const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456c98[0m <[0;33mline:650:5[0m, [0;33mcol:24[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x558829456c88[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456c70[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456c40[0m <[0;33mcol:14[0m> [0;32m'const fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456c30[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829453370[0m <[0;33mline:659:5[0m, [0;33mline:665:5[0m> [0;33mline:660:5[0m referenced[0;1;36m flags[0m [0;32m'fmtflags (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294532a8[0m <[0;33mcol:11[0m, [0;33mcol:20[0m> [0;33mcol:20[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829456ec0[0m <[0;33mline:661:5[0m, [0;33mline:665:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x558829456d80[0m <[0;33mline:662:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x558829456cc0[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456d68[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456d38[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456d28[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x558829456e58[0m <[0;33mline:663:7[0m, [0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456df0[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456de0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456e40[0m <[0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829456e20[0m <[0;33mcol:18[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294532a8[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x558829456eb0[0m <[0;33mline:664:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456e98[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829456e78[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x558829456cc0[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294534d0[0m <[0;33mline:675:5[0m, [0;33mline:681:5[0m> [0;33mline:676:5[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453440[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588294571a8[0m <[0;33mline:677:5[0m, [0;33mline:681:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x558829456fb8[0m <[0;33mline:678:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x558829456ef8[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829456fa0[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829456f70[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829456f60[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457128[0m <[0;33mline:679:7[0m, [0;33mcol:19[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457110[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457090[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942d628[0m[0;1;36m 'operator|='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829457028[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457018[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457078[0m <[0;33mcol:19[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457058[0m <[0;33mcol:19[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453440[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x558829457198[0m <[0;33mline:680:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457180[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457160[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x558829456ef8[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294536e0[0m <[0;33mline:692:5[0m, [0;33mline:699:5[0m> [0;33mline:693:5[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags, fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453590[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453608[0m <[0;33mcol:28[0m, [0;33mcol:37[0m> [0;33mcol:37[0m used[0;1;36m __mask[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588294576f8[0m <[0;33mline:694:5[0m, [0;33mline:699:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x5588294572a0[0m <[0;33mline:695:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x5588294571e0[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457288[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829457258[0m <[0;33mcol:24[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457248[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457480[0m <[0;33mline:696:7[0m, [0;33mcol:20[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457468[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457448[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942e0f0[0m[0;1;36m 'operator&='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829457310[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457300[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457418[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|   |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457400[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457378[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942d1f0[0m[0;1;36m 'operator~'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags)'[0m
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457360[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457340[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453608[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457678[0m <[0;33mline:697:7[0m, [0;33mcol:36[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457660[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457640[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942d628[0m[0;1;36m 'operator|='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829457510[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457500[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mParenExpr[0m[0;33m 0x558829457620[0m <[0;33mcol:19[0m, [0;33mcol:36[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m
[0;34m|   |   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x5588294575e8[0m <[0;33mcol:20[0m, [0;33mcol:30[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '&'
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588294575d0[0m <[0;33mcol:28[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags, _Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294575b0[0m <[0;33mcol:28[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags, _Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942c760[0m[0;1;36m 'operator&'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags, _Ios_Fmtflags)'[0m
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457580[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457540[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453590[0m[0;1;36m '__fmtfl'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457598[0m <[0;33mcol:30[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457560[0m <[0;33mcol:30[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453608[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x5588294576e8[0m <[0;33mline:698:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588294576d0[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294576b0[0m <[0;33mcol:14[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x5588294571e0[0m[0;1;36m '__old'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294538c0[0m <[0;33mline:707:5[0m, [0;33mline:709:28[0m> [0;33mline:708:5[0m used[0;1;36m unsetf[0m [0;32m'void (fmtflags)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294537b8[0m <[0;33mcol:12[0m, [0;33mcol:21[0m> [0;33mcol:21[0m used[0;1;36m __mask[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x5588294578c0[0m <[0;33mline:709:5[0m, [0;33mcol:28[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457888[0m <[0;33mcol:7[0m, [0;33mcol:20[0m> [0;32m'const _Ios_Fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457870[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(*)(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x558829457850[0m <[0;33mcol:16[0m> [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942e0f0[0m[0;1;36m 'operator&='[0m [0;32m'const _Ios_Fmtflags &(_Ios_Fmtflags &, _Ios_Fmtflags)'[0m
[0;34m|     |-[0m[0;1;35mMemberExpr[0m[0;33m 0x558829457780[0m <[0;33mcol:7[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x558829450b20[0m
[0;34m|     | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457770[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x558829457820[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'_Ios_Fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457808[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (*)(_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294577e8[0m <[0;33mcol:19[0m> [0;32m'_Ios_Fmtflags (_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55882942d1f0[0m[0;1;36m 'operator~'[0m [0;32m'_Ios_Fmtflags (_Ios_Fmtflags)'[0m
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x5588294577d0[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x5588294577b0[0m <[0;33mcol:20[0m> [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294537b8[0m[0;1;36m '__mask'[0m [0;32m'fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294539c0[0m <[0;33mline:718:5[0m, [0;33mline:720:28[0m> [0;33mline:719:5[0m referenced[0;1;36m precision[0m [0;32m'streamsize () const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x558829457940[0m <[0;33mline:720:5[0m, [0;33mcol:28[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x558829457930[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457918[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x5588294578e8[0m <[0;33mcol:14[0m> [0;32m'const streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x558829450a60[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x5588294578d8[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829453b40[0m <[0;33mline:727:5[0m, [0;33mline:733:5[0m> [0;33mline:728:5[0m[0;1;36m precision[0m [0;32m'streamsize (streamsize)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453a78[0m <[0;33mcol:15[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __prec[0m [0;32m'streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945d440[0m <[0;33mline:729:5[0m, [0;33mline:733:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x558829457a28[0m <[0;33mline:730:7[0m, [0;33mcol:38[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x558829457968[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x558829457a10[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x5588294579e0[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x558829450a60[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x5588294579d0[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x55882945d3d8[0m <[0;33mline:731:7[0m, [0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d370[0m <[0;33mcol:7[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x558829450a60[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x558829457a88[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d3c0[0m <[0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945d3a0[0m <[0;33mcol:22[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453a78[0m[0;1;36m '__prec'[0m [0;32m'streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945d430[0m <[0;33mline:732:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d418[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945d3f8[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x558829457968[0m[0;1;36m '__old'[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829453c20[0m <[0;33mline:741:5[0m, [0;33mline:743:24[0m> [0;33mline:742:5[0m referenced[0;1;36m width[0m [0;32m'streamsize () const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945d4d0[0m <[0;33mline:743:5[0m, [0;33mcol:24[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945d4c0[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d4a8[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d478[0m <[0;33mcol:14[0m> [0;32m'const streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x558829450ac0[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d468[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829453d68[0m <[0;33mline:750:5[0m, [0;33mline:756:5[0m> [0;33mline:751:5[0m referenced[0;1;36m width[0m [0;32m'streamsize (streamsize)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453cd8[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:22[0m used[0;1;36m __wide[0m [0;32m'streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945d6f8[0m <[0;33mline:752:5[0m, [0;33mline:756:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x55882945d5b8[0m <[0;33mline:753:7[0m, [0;33mcol:34[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x55882945d4f8[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d5a0[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d570[0m <[0;33mcol:26[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x558829450ac0[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d560[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x55882945d690[0m <[0;33mline:754:7[0m, [0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d628[0m <[0;33mcol:7[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x558829450ac0[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d618[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d678[0m <[0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945d658[0m <[0;33mcol:18[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829453cd8[0m[0;1;36m '__wide'[0m [0;32m'streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945d6e8[0m <[0;33mline:755:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d6d0[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945d6b0[0m <[0;33mcol:14[0m> [0;32m'streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x55882945d4f8[0m[0;1;36m '__old'[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829453f00[0m <[0;33mline:769:5[0m, [0;33mline:770:39[0m> [0;33mcol:5[0m[0;1;36m sync_with_stdio[0m [0;32m'bool (bool)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453e38[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:26[0m[0;1;36m __sync[0m [0;32m'bool'[0m cinit
[0;34m|   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x558829456448[0m <[0;33mcol:35[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829454098[0m <[0;33mline:781:5[0m, [0;33mline:782:38[0m> [0;33mcol:5[0m referenced[0;1;36m imbue[0m [0;32m'locale (const locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829453fc8[0m <[0;33mcol:11[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294541d0[0m <[0;33mline:792:5[0m, [0;33mline:794:29[0m> [0;33mline:793:5[0m[0;1;36m getloc[0m [0;32m'locale () const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945d7a0[0m <[0;33mline:794:5[0m, [0;33mcol:29[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945d790[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x55882945d760[0m <[0;33mcol:14[0m> [0;32m'locale':'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const locale &) throw()'[0m
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d730[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x5588294524d0[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d720[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829454308[0m <[0;33mline:803:5[0m, [0;33mline:805:29[0m> [0;33mline:804:5[0m referenced[0;1;36m _M_getloc[0m [0;32m'const locale &() const'[0m implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945d808[0m <[0;33mline:805:5[0m, [0;33mcol:29[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945d7f8[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d7c8[0m <[0;33mcol:14[0m> [0;32m'const locale':'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x5588294524d0[0m
[0;34m|       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d7b8[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829454410[0m <[0;33mline:822:5[0m, [0;33mline:823:20[0m> [0;33mcol:5[0m[0;1;36m xalloc[0m [0;32m'int () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588294545a8[0m <[0;33mline:838:5[0m, [0;33mline:844:5[0m> [0;33mline:839:5[0m[0;1;36m iword[0m [0;32m'long &(int)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294544d0[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945dda0[0m <[0;33mline:840:5[0m, [0;33mline:844:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x55882945dd28[0m <[0;33mline:841:7[0m, [0;33mline:842:47[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x55882945d838[0m <[0;33mline:841:7[0m, [0;33mline:842:46[0m> [0;33mline:841:15[0m used[0;1;36m __word[0m [0;32m'_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x55882945dca0[0m <[0;33mcol:24[0m, [0;33mline:842:46[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x55882945da00[0m <[0;33mline:841:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x55882945d9e0[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x55882945d908[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d8f0[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d8d8[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945d8a0[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294544d0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x55882945d9b8[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d9a0[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945d988[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945d940[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x558829452108[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945d930[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x55882945dab0[0m <[0;33mline:842:6[0m, [0;33mcol:18[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945da80[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945da30[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x5588294521a8[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945da20[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945da98[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945da60[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294544d0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x55882945db40[0m <[0;33mcol:22[0m, [0;33mcol:46[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945dae0[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x558829452408[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945dad0[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945db70[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945db10[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x5588294544d0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x55882945db30[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945dd90[0m <[0;33mline:843:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945dd60[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'long'[0m[0;36m lvalue[0m[0;36m[0m ._M_iword[0;33m 0x558829451b68[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945dd40[0m <[0;33mcol:14[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x55882945d838[0m[0;1;36m '__word'[0m [0;32m'_Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829454778[0m <[0;33mline:859:5[0m, [0;33mline:865:5[0m> [0;33mline:860:5[0m[0;1;36m pword[0m [0;32m'void *&(int)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829454670[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55882945e228[0m <[0;33mline:861:5[0m, [0;33mline:865:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x55882945e1b0[0m <[0;33mline:862:7[0m, [0;33mline:863:48[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x55882945ddd8[0m <[0;33mline:862:7[0m, [0;33mline:863:47[0m> [0;33mline:862:15[0m used[0;1;36m __word[0m [0;32m'_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x55882945e128[0m <[0;33mcol:24[0m, [0;33mline:863:47[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x55882945dfa0[0m <[0;33mline:862:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x55882945df80[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x55882945dea8[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945de90[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945de78[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945de40[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829454670[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x55882945df58[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945df40[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945df28[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945dee0[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x558829452108[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945ded0[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x55882945e050[0m <[0;33mline:863:6[0m, [0;33mcol:18[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945e020[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945dfd0[0m <[0;33mcol:6[0m> [0;32m'_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x5588294521a8[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945dfc0[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945e038[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945e000[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829454670[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x55882945e0e0[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945e080[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x558829452408[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x55882945e070[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55882945e110[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945e0b0[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x558829454670[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x55882945e0d0[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m false
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x55882945e218[0m <[0;33mline:864:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x55882945e1e8[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ._M_pword[0;33m 0x558829451b00[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55882945e1c8[0m <[0;33mcol:14[0m> [0;32m'_Words':'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x55882945ddd8[0m[0;1;36m '__word'[0m [0;32m'_Words &'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x558829454870[0m <[0;33mline:876:5[0m, [0;33mcol:23[0m> [0;33mcol:13[0m[0;1;36m ~ios_base[0m [0;32m'void () throw()'[0m virtual
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829454968[0m <[0;33mline:878:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588294549d0[0m <[0;33mline:879:5[0m, [0;33mcol:23[0m> [0;33mcol:5[0m referenced[0;1;36m ios_base[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829454a80[0m <[0;33mline:890:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x558829454c30[0m <[0;33mline:891:5[0m, [0;33mcol:38[0m> [0;33mcol:5[0m[0;1;36m ios_base[0m [0;32m'void (const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829454b28[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:29[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829454e28[0m <[0;33mline:893:5[0m, [0;33mline:894:39[0m> [0;33mcol:5[0m[0;1;36m operator=[0m [0;32m'ios_base &(const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829454d10[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x558829454ed8[0m <[0;33mline:896:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455028[0m <[0;33mline:897:5[0m, [0;33mline:898:24[0m> [0;33mcol:5[0m referenced[0;1;36m _M_move[0m [0;32m'void (ios_base &) noexcept'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x558829454f18[0m <[0;33mcol:13[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'ios_base &'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x558829455188[0m <[0;33mline:900:5[0m, [0;33mline:901:30[0m> [0;33mcol:5[0m referenced[0;1;36m _M_swap[0m [0;32m'void (ios_base &) noexcept'[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588294550f0[0m <[0;33mcol:13[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'ios_base &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base" = type { ptr, i64, i64, i32, i32, i32, ptr, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, ptr, %"class.std::locale" }
  NonVirtualBaseLLVMType:%"class.std::ios_base" = type { ptr, i64, i64, i32, i32, i32, ptr, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, ptr, %"class.std::locale" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x558828a27cc0[0m parent 0x558828a1c278 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_ios.tcc:178:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m class[0;1;36m basic_ios[0m definition explicit_instantiation_declaration
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mpublic [0;32m'ios_base':'std::ios_base'[0m
[0;34m|-[0mTemplateArgument type [0;32m'char'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588295b46d0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_ios.h:67:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m basic_ios[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295b4760[0m <[0;33mline:69:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b47d0[0m <[0;33mline:76:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m referenced[0;1;36m char_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b48f0[0m <[0;33mline:77:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m int_type[0m [0;32m'typename char_traits<char>::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b48a0[0m [0;32m'typename char_traits<char>::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x558828d71e20[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d702b0[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0a0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b49c0[0m <[0;33mline:78:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m pos_type[0m [0;32m'typename char_traits<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4970[0m [0;32m'typename char_traits<char>::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x55882947b300[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d70350[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x558828d70310[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x558828d62e70[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x558828a1bd30[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a1bcc0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x558828a1bc70[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m|             |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a1bb30[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x558828a1bb00[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x558828a0e110[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x5588289fc5d0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x5588289e9420[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x5588289e93e0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x5588289e93b0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x5588289e9338[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x5588289e92e0[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mRecordType[0m[0;33m 0x5588289d19e0[0m [0;32m'__mbstate_t'[0m
[0;34m|             |               `-[0m[0;1;32mCXXRecord[0m[0;33m 0x5588289d1948[0m[0;1;36m ''[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x558828a1bc50[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a1bb70[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b4a90[0m <[0;33mline:79:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m off_type[0m [0;32m'typename char_traits<char>::off_type':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4a40[0m [0;32m'typename char_traits<char>::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x55882947b400[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d703b8[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a16cf0[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x558828a16cc0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x558828a16748[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0c0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b4af8[0m <[0;33mline:80:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m traits_type[0m [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4830[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b4c00[0m <[0;33mline:87:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m referenced[0;1;36m __ctype_type[0m [0;32m'ctype<char>':'std::ctype<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4bb0[0m [0;32m'ctype<char>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295b4b60[0m [0;32m'ctype<char>'[0m sugar ctype
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558828dd6c00[0m [0;32m'std::ctype<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x5588294d2eb8[0m[0;1;36m 'ctype'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b4e08[0m <[0;33mline:88:7[0m, [0;33mline:89:12[0m> [0;33mcol:12[0m referenced[0;1;36m __num_put_type[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>':'std::num_put<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4db0[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295b4d50[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar num_put
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'ostreambuf_iterator<char, char_traits<char>>':'std::ostreambuf_iterator<char>'[0m
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4cf0[0m [0;32m'ostreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295b4c90[0m [0;32m'ostreambuf_iterator<char, std::char_traits<char>>'[0m sugar ostreambuf_iterator
[0;34m|     |     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4830[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x55882947bd80[0m [0;32m'std::ostreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x55882947bc88[0m[0;1;36m 'ostreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558829583cf0[0m [0;32m'std::num_put<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558829583bf0[0m[0;1;36m 'num_put'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295b5008[0m <[0;33mline:90:7[0m, [0;33mline:91:12[0m> [0;33mcol:12[0m referenced[0;1;36m __num_get_type[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>':'std::num_get<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4fb0[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295b4f50[0m [0;32m'num_get<char, istreambuf_iterator<char, char_traits<char>>>'[0m sugar num_get
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'istreambuf_iterator<char, char_traits<char>>':'std::istreambuf_iterator<char>'[0m
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295b4ef0[0m [0;32m'istreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295b4e90[0m [0;32m'istreambuf_iterator<char, std::char_traits<char>>'[0m sugar istreambuf_iterator
[0;34m|     |     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4790[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295b4830[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x55882947bb40[0m [0;32m'std::istreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x55882947ba48[0m[0;1;36m 'istreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x55882957c340[0m [0;32m'std::num_get<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x55882957c240[0m[0;1;36m 'num_get'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295b5060[0m <[0;33mline:95:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b51d0[0m <[0;33mline:96:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_tie[0m [0;32m'basic_ostream<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b5290[0m <[0;33mline:97:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_fill[0m [0;32m'char_type':'char'[0m mutable
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b52e0[0m <[0;33mline:98:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_fill_init[0m [0;32m'bool'[0m mutable
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b5440[0m <[0;33mline:99:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_streambuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b5538[0m <[0;33mline:102:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_ctype[0m [0;32m'const __ctype_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b5668[0m <[0;33mline:104:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_num_put[0m [0;32m'const __num_put_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295b5798[0m <[0;33mline:106:7[0m, [0;33mcol:54[0m> [0;33mcol:54[0m[0;1;36m _M_num_get[0m [0;32m'const __num_get_type *'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295b57e8[0m <[0;33mline:108:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x5588295b5810[0m <[0;33mline:117:7[0m, [0;33mline:118:31[0m> [0;33mline:117:16[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a1d60[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b58d8[0m <[0;33mline:124:7[0m, [0;33mline:126:30[0m> [0;33mline:125:7[0m[0;1;36m operator![0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a1e38[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5990[0m <[0;33mline:136:7[0m, [0;33mline:138:36[0m> [0;33mline:137:7[0m[0;1;36m rdstate[0m [0;32m'iostate () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a1f60[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5ad8[0m <[0;33mline:147:7[0m, [0;33mline:148:38[0m> [0;33mcol:7[0m[0;1;36m clear[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a2150[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b5a48[0m <[0;33mcol:13[0m, [0;33mcol:31[0m> [0;33mcol:21[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5c28[0m <[0;33mline:156:7[0m, [0;33mline:158:49[0m> [0;33mline:157:7[0m[0;1;36m setstate[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a22a0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b5b98[0m <[0;33mcol:16[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5d78[0m <[0;33mline:163:7[0m, [0;33mline:171:7[0m> [0;33mline:164:7[0m[0;1;36m _M_setstate[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a23f0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b5ce8[0m <[0;33mcol:19[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __state[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5e38[0m <[0;33mline:179:7[0m, [0;33mline:181:38[0m> [0;33mline:180:7[0m[0;1;36m good[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a24c0[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5ef0[0m <[0;33mline:189:7[0m, [0;33mline:191:49[0m> [0;33mline:190:7[0m[0;1;36m eof[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a2588[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b5fa8[0m <[0;33mline:200:7[0m, [0;33mline:202:61[0m> [0;33mline:201:7[0m[0;1;36m fail[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a2650[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6060[0m <[0;33mline:210:7[0m, [0;33mline:212:49[0m> [0;33mline:211:7[0m[0;1;36m bad[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a2718[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6118[0m <[0;33mline:221:7[0m, [0;33mline:223:30[0m> [0;33mline:222:7[0m[0;1;36m exceptions[0m [0;32m'iostate () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a27e0[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6260[0m <[0;33mline:256:7[0m, [0;33mline:261:7[0m> [0;33mline:257:7[0m[0;1;36m exceptions[0m [0;32m'void (iostate)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a2928[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b61d0[0m <[0;33mcol:18[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __except[0m [0;32m'iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295b6588[0m <[0;33mline:269:7[0m, [0;33mline:273:27[0m> [0;33mline:270:7[0m[0;1;36m basic_ios[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a2c50[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b6440[0m <[0;33mcol:17[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588295b6678[0m <[0;33mline:281:7[0m, [0;33mline:282:22[0m> [0;33mcol:7[0m[0;1;36m ~basic_ios[0m [0;32m'void () throw()'[0m explicit_instantiation_declaration virtual implicit-inline instantiated_from[0;33m 0x5588295a2d88[0m
[0;34m| `-[0mOverrides: [ 0x558829454870 ios_base::~ios_base 'void () throw()' ]
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6930[0m <[0;33mline:294:7[0m, [0;33mline:296:24[0m> [0;33mline:295:7[0m[0;1;36m tie[0m [0;32m'basic_ostream<char, char_traits<char>> *() const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a3020[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6d10[0m <[0;33mline:306:7[0m, [0;33mline:312:7[0m> [0;33mline:307:7[0m[0;1;36m tie[0m [0;32m'basic_ostream<char, char_traits<char>> *(basic_ostream<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a3450[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b6be0[0m <[0;33mcol:11[0m, [0;33mcol:43[0m> [0;33mcol:43[0m[0;1;36m __tiestr[0m [0;32m'basic_ostream<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b6f60[0m <[0;33mline:320:7[0m, [0;33mline:322:30[0m> [0;33mline:321:7[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *() const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a36c0[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b7340[0m <[0;33mline:346:7[0m, [0;33mline:347:51[0m> [0;33mcol:7[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char, char_traits<char>> *(basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a3af0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b7210[0m <[0;33mcol:13[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b75f8[0m <[0;33mline:360:7[0m, [0;33mline:361:37[0m> [0;33mcol:7[0m[0;1;36m copyfmt[0m [0;32m'basic_ios<char> &(const basic_ios<char> &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a3d68[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b74e8[0m <[0;33mcol:15[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m __rhs[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b7710[0m <[0;33mline:369:7[0m, [0;33mline:378:7[0m> [0;33mline:370:7[0m[0;1;36m fill[0m [0;32m'char_type () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a3e70[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b78e0[0m <[0;33mline:389:7[0m, [0;33mline:395:7[0m> [0;33mline:390:7[0m[0;1;36m fill[0m [0;32m'char_type (char_type)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a3ff0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b77d8[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:22[0m[0;1;36m __ch[0m [0;32m'char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b7a40[0m <[0;33mline:409:7[0m, [0;33mline:410:32[0m> [0;33mcol:7[0m[0;1;36m imbue[0m [0;32m'locale (const locale &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a4158[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b79b0[0m <[0;33mcol:13[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b7c50[0m <[0;33mline:429:7[0m, [0;33mline:431:63[0m> [0;33mline:430:7[0m[0;1;36m narrow[0m [0;32m'char (char_type, char) const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a4370[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b7b10[0m <[0;33mcol:14[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b7b78[0m <[0;33mcol:29[0m, [0;33mcol:34[0m> [0;33mcol:34[0m[0;1;36m __dfault[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b7de0[0m <[0;33mline:448:7[0m, [0;33mline:450:52[0m> [0;33mline:449:7[0m[0;1;36m widen[0m [0;32m'char_type (char) const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a4500[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b7d18[0m <[0;33mcol:13[0m, [0;33mcol:18[0m> [0;33mcol:18[0m[0;1;36m __c[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295b7ea0[0m <[0;33mline:452:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295b7ee8[0m <[0;33mline:460:7[0m, [0;33mline:463:9[0m> [0;33mline:460:7[0m[0;1;36m basic_ios[0m [0;32m'void ()'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a45f8[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b81a0[0m <[0;33mline:471:7[0m, [0;33mline:472:50[0m> [0;33mcol:7[0m[0;1;36m init[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a48d0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b80d0[0m <[0;33mcol:12[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295b83a0[0m <[0;33mline:475:7[0m, [0;33mcol:42[0m> [0;33mcol:7[0m[0;1;36m basic_ios[0m [0;32m'void (const basic_ios<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x5588295a4aa0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8278[0m <[0;33mcol:17[0m, [0;33mcol:32[0m> [0;33mcol:33[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8528[0m <[0;33mline:476:7[0m, [0;33mcol:53[0m> [0;33mcol:18[0m[0;1;36m operator=[0m [0;32m'basic_ios<char> &(const basic_ios<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x5588295a4c18[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8490[0m <[0;33mcol:28[0m, [0;33mcol:43[0m> [0;33mcol:44[0m [0;32m'const basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8710[0m <[0;33mline:478:7[0m, [0;33mline:487:7[0m> [0;33mline:479:7[0m[0;1;36m move[0m [0;32m'void (basic_ios<char> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a4df0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8600[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8950[0m <[0;33mline:489:7[0m, [0;33mline:491:28[0m> [0;33mline:490:7[0m[0;1;36m move[0m [0;32m'void (basic_ios<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a5020[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8848[0m <[0;33mcol:12[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8b48[0m <[0;33mline:493:7[0m, [0;33mline:502:7[0m> [0;33mline:494:7[0m[0;1;36m swap[0m [0;32m'void (basic_ios<char> &) noexcept'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a5208[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8a38[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'basic_ios<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8df0[0m <[0;33mline:504:7[0m, [0;33mline:506:30[0m> [0;33mline:505:7[0m[0;1;36m set_rdbuf[0m [0;32m'void (basic_streambuf<char, char_traits<char>> *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295a54d0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8d20[0m <[0;33mcol:17[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char, char_traits<char>> *'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295b8f40[0m <[0;33mline:509:7[0m, [0;33mline:510:42[0m> [0;33mcol:7[0m[0;1;36m _M_cache_locale[0m [0;32m'void (const locale &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295a5628[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295b8eb0[0m <[0;33mcol:23[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::basic_ios" = type { %"class.std::ios_base", ptr, i8, i8, ptr, ptr, ptr, ptr }
  NonVirtualBaseLLVMType:%"class.std::basic_ios" = type { %"class.std::ios_base", ptr, i8, i8, ptr, ptr, ptr, ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x558828a285c0[0m parent 0x558828a1c278 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ostream.tcc:359:3[0m, [0;33mcol:43[0m> [0;33mcol:25[0m class[0;1;36m basic_ostream[0m definition explicit_instantiation_declaration
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mvirtual public [0;32m'basic_ios<char, char_traits<char>>':'std::basic_ios<char>'[0m
[0;34m|-[0mTemplateArgument type [0;32m'char'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588295e8e20[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/ostream:58:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m basic_ostream[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295e8eb0[0m <[0;33mline:60:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e8ee8[0m <[0;33mline:62:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m char_type[0m [0;32m'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e8fd0[0m <[0;33mline:63:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m int_type[0m [0;32m'typename char_traits<char>::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e8f80[0m [0;32m'typename char_traits<char>::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x558828d71e20[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d702b0[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0a0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e90a0[0m <[0;33mline:64:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m pos_type[0m [0;32m'typename char_traits<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9050[0m [0;32m'typename char_traits<char>::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x55882947b300[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d70350[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x558828d70310[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x558828d62e70[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x558828a1bd30[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a1bcc0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x558828a1bc70[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m|             |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a1bb30[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x558828a1bb00[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x558828a0e110[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x5588289fc5d0[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x5588289e9420[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x5588289e93e0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x5588289e93b0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x5588289e9338[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x5588289e92e0[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mRecordType[0m[0;33m 0x5588289d19e0[0m [0;32m'__mbstate_t'[0m
[0;34m|             |               `-[0m[0;1;32mCXXRecord[0m[0;33m 0x5588289d1948[0m[0;1;36m ''[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x558828a1bc50[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a1bb70[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9170[0m <[0;33mline:65:7[0m, [0;33mcol:44[0m> [0;33mcol:44[0m referenced[0;1;36m off_type[0m [0;32m'typename char_traits<char>::off_type':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9120[0m [0;32m'typename char_traits<char>::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x55882947b400[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x558828d703b8[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x558828a16cf0[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x558828a16cc0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x558828a16748[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0c0[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e91d8[0m <[0;33mline:66:7[0m, [0;33mcol:28[0m> [0;33mcol:28[0m referenced[0;1;36m traits_type[0m [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ce0[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9308[0m <[0;33mline:69:7[0m, [0;33mcol:50[0m> [0;33mcol:50[0m referenced[0;1;36m __streambuf_type[0m [0;32m'basic_streambuf<char, char_traits<char>>':'std::basic_streambuf<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e92b0[0m [0;32m'basic_streambuf<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e9250[0m [0;32m'basic_streambuf<char, std::char_traits<char>>'[0m sugar basic_streambuf
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ce0[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558828a280c0[0m [0;32m'std::basic_streambuf<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27fc0[0m[0;1;36m 'basic_streambuf'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9438[0m <[0;33mline:70:7[0m, [0;33mcol:43[0m> [0;33mcol:43[0m referenced[0;1;36m __ios_type[0m [0;32m'basic_ios<char, char_traits<char>>':'std::basic_ios<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e93e0[0m [0;32m'basic_ios<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e9380[0m [0;32m'basic_ios<char, std::char_traits<char>>'[0m sugar basic_ios
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ce0[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558828a27dc0[0m [0;32m'std::basic_ios<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a27cc0[0m[0;1;36m 'basic_ios'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9568[0m <[0;33mline:71:7[0m, [0;33mcol:47[0m> [0;33mcol:47[0m referenced[0;1;36m __ostream_type[0m [0;32m'basic_ostream<char, char_traits<char>>':'std::basic_ostream<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9510[0m [0;32m'basic_ostream<char, char_traits<char>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e94b0[0m [0;32m'basic_ostream<char, std::char_traits<char>>'[0m sugar basic_ostream
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ce0[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558828a286c0[0m [0;32m'std::basic_ostream<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9768[0m <[0;33mline:72:7[0m, [0;33mline:73:14[0m> [0;33mcol:14[0m referenced[0;1;36m __num_put_type[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>':'std::num_put<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9710[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e96b0[0m [0;32m'num_put<char, ostreambuf_iterator<char, char_traits<char>>>'[0m sugar num_put
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |-[0mTemplateArgument type [0;32m'ostreambuf_iterator<char, char_traits<char>>':'std::ostreambuf_iterator<char>'[0m
[0;34m|     | `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9650[0m [0;32m'ostreambuf_iterator<char, char_traits<char>>'[0m sugar
[0;34m|     |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e95f0[0m [0;32m'ostreambuf_iterator<char, std::char_traits<char>>'[0m sugar ostreambuf_iterator
[0;34m|     |     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     |     |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|     |     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ce0[0m [0;32m'std::char_traits<char>'[0m sugar typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m|     |     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |     |   `-[0m[0;32mRecordType[0m[0;33m 0x5588289cda00[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     |     |     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828d6ffb0[0m[0;1;36m 'char_traits'[0m
[0;34m|     |     `-[0m[0;32mRecordType[0m[0;33m 0x55882947bd80[0m [0;32m'std::ostreambuf_iterator<char>'[0m
[0;34m|     |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x55882947bc88[0m[0;1;36m 'ostreambuf_iterator'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558829583cf0[0m [0;32m'std::num_put<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558829583bf0[0m[0;1;36m 'num_put'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x5588295e9870[0m <[0;33mline:74:7[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __ctype_type[0m [0;32m'ctype<char>':'std::ctype<char>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x5588295e9820[0m [0;32m'ctype<char>'[0m sugar
[0;34m|   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x5588295e97d0[0m [0;32m'ctype<char>'[0m sugar ctype
[0;34m|     |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|     | `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x5588295e8ca0[0m [0;32m'char'[0m sugar typename depth 0 index 0[0;1;36m _CharT[0m
[0;34m|     |   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x558828a285c0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|     |   `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f040[0m [0;32m'char'[0m
[0;34m|     `-[0m[0;32mRecordType[0m[0;33m 0x558828dd6c00[0m [0;32m'std::ctype<char>'[0m
[0;34m|       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x5588294d2eb8[0m[0;1;36m 'ctype'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295e9a78[0m <[0;33mline:83:7[0m, [0;33mline:85:27[0m> [0;33mline:84:7[0m[0;1;36m basic_ostream[0m [0;32m'void (__streambuf_type *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bed20[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295e9978[0m <[0;33mcol:21[0m, [0;33mcol:39[0m> [0;33mcol:39[0m[0;1;36m __sb[0m [0;32m'__streambuf_type *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588295e9b68[0m <[0;33mline:92:7[0m, [0;33mline:93:26[0m> [0;33mcol:7[0m[0;1;36m ~basic_ostream[0m [0;32m'void () throw()'[0m explicit_instantiation_declaration virtual implicit-inline instantiated_from[0;33m 0x5588295bee58[0m
[0;34m| `-[0mOverrides: [ 0x5588295b6678 basic_ios::~basic_ios 'void () throw()' ]
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588295e9c68[0m <[0;33mline:96:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m class[0;1;36m sentry[0m definition instantiated_from[0;33m 0x5588295bef10[0m
[0;34m| |-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x5588295effe0[0m <[0;33mline:432:5[0m, [0;33mcol:43[0m> [0;33mcol:43[0m implicit class[0;1;36m sentry[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295f0070[0m <[0;33mline:435:7[0m, [0;33mcol:16[0m> [0;33mcol:16[0m[0;1;36m _M_ok[0m [0;32m'bool'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x5588295f01d0[0m <[0;33mline:436:7[0m, [0;33mcol:40[0m> [0;33mcol:40[0m[0;1;36m _M_os[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295f0220[0m <[0;33mline:438:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295f0468[0m <[0;33mline:450:7[0m, [0;33mline:451:50[0m> [0;33mcol:7[0m[0;1;36m sentry[0m [0;32m'void (basic_ostream<char, char_traits<char>> &)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c6d30[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f0360[0m <[0;33mcol:14[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __os[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x5588295f0558[0m <[0;33mline:462:7[0m, [0;33mline:471:7[0m> [0;33mline:462:7[0m[0;1;36m ~sentry[0m [0;32m'void ()'[0m explicit_instantiation_declaration noexcept-unevaluated 0x5588295f0558 implicit-inline instantiated_from[0;33m 0x5588295c6e68[0m
[0;34m| `-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x5588295f0690[0m <[0;33mline:482:7[0m, [0;33mline:485:23[0m> [0;33mline:484:7[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c6f80[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x5588295e9d80[0m <[0;33mline:97:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class sentry':'std::basic_ostream<char>::sentry'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ea138[0m <[0;33mline:107:7[0m, [0;33mline:114:7[0m> [0;33mline:108:7[0m used[0;1;36m operator<<[0m [0;32m'__ostream_type &(__ostream_type &(*)(__ostream_type &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bf3f8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ea020[0m <[0;33mcol:18[0m, [0;33mcol:57[0m> [0;33mcol:36[0m[0;1;36m __pf[0m [0;32m'__ostream_type &(*)(__ostream_type &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ea578[0m <[0;33mline:116:7[0m, [0;33mline:124:7[0m> [0;33mline:117:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(__ios_type &(*)(__ios_type &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bf858[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ea460[0m <[0;33mcol:18[0m, [0;33mcol:49[0m> [0;33mcol:32[0m[0;1;36m __pf[0m [0;32m'__ios_type &(*)(__ios_type &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ea758[0m <[0;33mline:126:7[0m, [0;33mline:134:7[0m> [0;33mline:127:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(ios_base &(*)(ios_base &))'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bfb88[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ea648[0m <[0;33mcol:18[0m, [0;33mcol:46[0m> [0;33mcol:30[0m[0;1;36m __pf[0m [0;32m'ios_base &(*)(ios_base &)'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ea938[0m <[0;33mline:165:7[0m, [0;33mline:167:32[0m> [0;33mline:166:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bfd78[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ea828[0m <[0;33mcol:18[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __n[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eab18[0m <[0;33mline:169:7[0m, [0;33mline:171:32[0m> [0;33mline:170:7[0m used[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295bff68[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eaa08[0m <[0;33mcol:18[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m __n[0m [0;32m'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eacf8[0m <[0;33mline:173:7[0m, [0;33mline:175:32[0m> [0;33mline:174:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(bool)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0148[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eabe8[0m <[0;33mcol:18[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __n[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eaed8[0m <[0;33mline:177:7[0m, [0;33mline:178:27[0m> [0;33mcol:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(short)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c0338[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eadc8[0m <[0;33mcol:18[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __n[0m [0;32m'short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eb0b8[0m <[0;33mline:180:7[0m, [0;33mline:186:7[0m> [0;33mline:181:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned short)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0528[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eafa8[0m <[0;33mcol:18[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __n[0m [0;32m'unsigned short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eb298[0m <[0;33mline:188:7[0m, [0;33mline:189:25[0m> [0;33mcol:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(int)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c0718[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eb188[0m <[0;33mcol:18[0m, [0;33mcol:22[0m> [0;33mcol:22[0m[0;1;36m __n[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eb478[0m <[0;33mline:191:7[0m, [0;33mline:197:7[0m> [0;33mline:192:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned int)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0908[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eb368[0m <[0;33mcol:18[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __n[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eb658[0m <[0;33mline:200:7[0m, [0;33mline:202:32[0m> [0;33mline:201:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0af8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eb548[0m <[0;33mcol:18[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __n[0m [0;32m'long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eb838[0m <[0;33mline:204:7[0m, [0;33mline:206:32[0m> [0;33mline:205:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(unsigned long long)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0ce8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eb728[0m <[0;33mcol:18[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __n[0m [0;32m'unsigned long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eba18[0m <[0;33mline:219:7[0m, [0;33mline:221:32[0m> [0;33mline:220:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(double)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c0ed8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eb908[0m <[0;33mcol:18[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __f[0m [0;32m'double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ebbf8[0m <[0;33mline:223:7[0m, [0;33mline:229:7[0m> [0;33mline:224:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(float)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c10c8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ebae8[0m <[0;33mcol:18[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __f[0m [0;32m'float'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ebdd8[0m <[0;33mline:231:7[0m, [0;33mline:233:32[0m> [0;33mline:232:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(long double)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c12b8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ebcc8[0m <[0;33mcol:18[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __f[0m [0;32m'long double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ebfb8[0m <[0;33mline:244:7[0m, [0;33mline:246:32[0m> [0;33mline:245:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(const void *)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c14a8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ebea8[0m <[0;33mcol:18[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __p[0m [0;32m'const void *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ec198[0m <[0;33mline:249:7[0m, [0;33mline:251:36[0m> [0;33mline:250:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(nullptr_t)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c1688[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ec088[0m <[0;33mcol:18[0m> [0;33mcol:27[0m [0;32m'nullptr_t':'std::nullptr_t'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ec398[0m <[0;33mline:275:7[0m, [0;33mline:276:40[0m> [0;33mcol:7[0m[0;1;36m operator<<[0m [0;32m'__ostream_type &(__streambuf_type *)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c1878[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ec280[0m <[0;33mcol:18[0m, [0;33mcol:36[0m> [0;33mcol:36[0m[0;1;36m __sb[0m [0;32m'__streambuf_type *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ec5f8[0m <[0;33mline:308:7[0m, [0;33mline:309:24[0m> [0;33mcol:7[0m[0;1;36m put[0m [0;32m'__ostream_type &(char_type)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c1ac8[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ec4e0[0m <[0;33mcol:11[0m, [0;33mcol:21[0m> [0;33mcol:21[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ee1e0[0m <[0;33mline:316:7[0m, [0;33mline:322:7[0m> [0;33mline:317:7[0m[0;1;36m _M_write[0m [0;32m'void (const char_type *, streamsize)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c1d60[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ee058[0m <[0;33mcol:16[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __s[0m [0;32m'const char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ee0c0[0m <[0;33mcol:38[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __n[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ee448[0m <[0;33mline:340:7[0m, [0;33mline:341:49[0m> [0;33mcol:7[0m[0;1;36m write[0m [0;32m'__ostream_type &(const char_type *, streamsize)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c1fc8[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ee2c0[0m <[0;33mcol:13[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __s[0m [0;32m'const char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ee328[0m <[0;33mcol:35[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __n[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ee598[0m <[0;33mline:353:7[0m, [0;33mline:354:13[0m> [0;33mcol:7[0m[0;1;36m flush[0m [0;32m'__ostream_type &()'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c2108[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ee730[0m <[0;33mline:363:7[0m, [0;33mline:364:13[0m> [0;33mcol:7[0m[0;1;36m tellp[0m [0;32m'pos_type ()'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c2290[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ee908[0m <[0;33mline:374:7[0m, [0;33mline:375:21[0m> [0;33mcol:7[0m[0;1;36m seekp[0m [0;32m'__ostream_type &(pos_type)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c2458[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ee7f8[0m <[0;33mcol:13[0m> [0;33mcol:21[0m [0;32m'pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295eebc8[0m <[0;33mline:386:8[0m, [0;33mline:387:40[0m> [0;33mcol:7[0m[0;1;36m seekp[0m [0;32m'__ostream_type &(off_type, ios_base::seekdir)'[0m explicit_instantiation_declaration instantiated_from[0;33m 0x5588295c2768[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eea40[0m <[0;33mcol:13[0m> [0;33mcol:21[0m [0;32m'off_type':'long'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eeaa8[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:40[0m [0;32m'ios_base::seekdir':'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x5588295eeca0[0m <[0;33mline:389:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295eece8[0m <[0;33mline:390:7[0m, [0;33mline:391:24[0m> [0;33mline:390:7[0m[0;1;36m basic_ostream[0m [0;32m'void ()'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c2878[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295ef030[0m <[0;33mline:395:7[0m, [0;33mcol:57[0m> [0;33mcol:7[0m[0;1;36m basic_ostream[0m [0;32m'void (basic_iostream<char, char_traits<char>> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c2bc0[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295eef00[0m <[0;33mcol:21[0m, [0;33mcol:52[0m> [0;33mcol:53[0m [0;32m'basic_iostream<char, char_traits<char>> &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295ef2e0[0m <[0;33mline:397:7[0m, [0;33mcol:50[0m> [0;33mcol:7[0m[0;1;36m basic_ostream[0m [0;32m'void (const basic_ostream<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x5588295c2e10[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ef1b8[0m <[0;33mcol:21[0m, [0;33mcol:40[0m> [0;33mcol:41[0m [0;32m'const basic_ostream<char> &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x5588295ef560[0m <[0;33mline:399:7[0m, [0;33mline:401:34[0m> [0;33mline:399:7[0m[0;1;36m basic_ostream[0m [0;32m'void (basic_ostream<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c3060[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ef438[0m <[0;33mcol:21[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ef798[0m <[0;33mline:405:7[0m, [0;33mcol:61[0m> [0;33mcol:22[0m[0;1;36m operator=[0m [0;32m'basic_ostream<char> &(const basic_ostream<char> &)'[0m explicit_instantiation_declaration delete implicit-inline instantiated_from[0;33m 0x5588295c3288[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ef688[0m <[0;33mcol:32[0m, [0;33mcol:51[0m> [0;33mcol:52[0m [0;32m'const basic_ostream<char> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295ef988[0m <[0;33mline:407:7[0m, [0;33mline:412:7[0m> [0;33mline:408:7[0m[0;1;36m operator=[0m [0;32m'basic_ostream<char> &(basic_ostream<char> &&)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c3468[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295ef870[0m <[0;33mcol:17[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295efb80[0m <[0;33mline:414:7[0m, [0;33mline:416:34[0m> [0;33mline:415:7[0m[0;1;36m swap[0m [0;32m'void (basic_ostream<char> &)'[0m explicit_instantiation_declaration implicit-inline instantiated_from[0;33m 0x5588295c3650[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295efa70[0m <[0;33mcol:12[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __rhs[0m [0;32m'basic_ostream<char> &'[0m
[0;34m`-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x5588295efea0[0m <[0;33mline:419:7[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m
[0;34m  |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x5588295efc40[0m <[0;33mline:419:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _ValueT[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295efdf8[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(_ValueT)'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295efce8[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'_ValueT'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f66f8[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'long'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0c0[0m [0;32m'long'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f6620[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f6a78[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(unsigned long)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'unsigned long'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f160[0m [0;32m'unsigned long'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f69a0[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'unsigned long'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f6de8[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(bool)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'bool'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f020[0m [0;32m'bool'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f6d10[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'bool'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f7168[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long long)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'long long'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f0e0[0m [0;32m'long long'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f7090[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long long'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f74e8[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(unsigned long long)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'unsigned long long'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f180[0m [0;32m'unsigned long long'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f7410[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'unsigned long long'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f7868[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(double)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'double'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f1c0[0m [0;32m'double'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f7790[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'double'[0m
[0;34m  |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f7be8[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(long double)'[0m explicit_instantiation_declaration
[0;34m  | |-[0mTemplateArgument type [0;32m'long double'[0m
[0;34m  | | `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f1e0[0m [0;32m'long double'[0m
[0;34m  | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f7b10[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'long double'[0m
[0;34m  `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x5588295f7f68[0m <[0;33mline:420:2[0m, [0;33mline:421:23[0m> [0;33mcol:2[0m[0;1;36m _M_insert[0m [0;32m'__ostream_type &(const void *)'[0m explicit_instantiation_declaration
[0;34m    |-[0mTemplateArgument type [0;32m'const void *'[0m
[0;34m    | `-[0m[0;32mPointerType[0m[0;33m 0x558828a3ef00[0m [0;32m'const void *'[0m
[0;34m    |   `-[0mQualType[0;33m 0x55882892f001[0m [0;32m'const void'[0m const
[0;34m    |     `-[0m[0;32mBuiltinType[0m[0;33m 0x55882892f000[0m [0;32m'void'[0m
[0;34m    `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x5588295f7e90[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __v[0m [0;32m'const void *'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::basic_ostream" = type { ptr, %"class.std::basic_ios" }
  NonVirtualBaseLLVMType:%"class.std::basic_ostream.base" = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class Base
         0 |   int x
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class Child
         0 |   class Base (base)
         0 |     int x
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<int, int> (empty)
         0 |   struct std::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::is_same<long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<float, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]
