
*** Dumping AST Record Layout
         0 | class std::exception
         0 |   (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::type_info
         0 |   (type_info vtable pointer)
         8 |   const char * __name
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_alloc
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__exception_ptr::exception_ptr
         0 |   void * _M_exception_object
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::nested_exception
         0 |   (nested_exception vtable pointer)
         8 |   class std::__exception_ptr::exception_ptr _M_ptr
         8 |     void * _M_exception_object
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_val (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Val_less_iter (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_val (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __locale_struct
         0 |   struct __locale_data *[13] __locales
       104 |   const unsigned short * __ctype_b
       112 |   const int * __ctype_tolower
       120 |   const int * __ctype_toupper
       128 |   const char *[13] __names
           | [sizeof=232, dsize=232, align=8,
           |  nvsize=232, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __va_list_tag
         0 |   unsigned int gp_offset
         4 |   unsigned int fp_offset
         8 |   void * overflow_arg_area
        16 |   void * reg_save_area
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (unnamed at /usr/include/pthread.h:501:3)
         0 |   __jmp_buf __cancel_jmp_buf
        64 |   int __mask_was_saved
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | union pthread_attr_t
         0 |   char[56] __size
         0 |   long __align
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutex_t
         0 |   struct __pthread_mutex_s __data
         0 |     int __lock
         4 |     unsigned int __count
         8 |     int __owner
        12 |     unsigned int __nusers
        16 |     int __kind
        20 |     short __spins
        22 |     short __elision
        24 |     struct __pthread_internal_list __list
        24 |       struct __pthread_internal_list * __prev
        32 |       struct __pthread_internal_list * __next
         0 |   char[40] __size
         0 |   long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutexattr_t
         0 |   char[4] __size
         0 |   int __align
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17)
         0 |   unsigned long long __wseq
         0 |   struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17)
         0 |   unsigned long long __g1_start
         0 |   struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17) 
         0 |     unsigned long long __wseq
         0 |     struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17) 
         8 |     unsigned long long __g1_start
         8 |     struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int[2] __g_refs
        24 |   unsigned int[2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int[2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_cond_t
         0 |   struct __pthread_cond_s __data
         0 |     union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:94:17) 
         0 |       unsigned long long __wseq
         0 |       struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:97:5) __wseq32
         0 |         unsigned int __low
         4 |         unsigned int __high
         8 |     union __pthread_cond_s::(anonymous at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:103:17) 
         8 |       unsigned long long __g1_start
         8 |       struct __pthread_cond_s::(unnamed at /usr/include/x86_64-linux-gnu/bits/thread-shared-types.h:106:5) __g1_start32
         8 |         unsigned int __low
        12 |         unsigned int __high
        16 |     unsigned int[2] __g_refs
        24 |     unsigned int[2] __g_size
        32 |     unsigned int __g1_orig_size
        36 |     unsigned int __wrefs
        40 |     unsigned int[2] __g_signals
         0 |   char[48] __size
         0 |   long long __align
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const volatile void *, const volatile void *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char>
         0 |   size_t _M_len
         8 |   const char * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<wchar_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<wchar_t>
         0 |   size_t _M_len
         8 |   const wchar_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char16_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char16_t>
         0 |   size_t _M_len
         8 |   const char16_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<char32_t> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::basic_string_view<char32_t>
         0 |   size_t _M_len
         8 |   const char32_t * _M_str
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::input_iterator_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::forward_iterator_tag (empty)
         0 |   struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::bidirectional_iterator_tag (empty)
         0 |   struct std::forward_iterator_tag (base) (empty)
         0 |     struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::random_access_iterator_tag (empty)
         0 |   struct std::bidirectional_iterator_tag (base) (empty)
         0 |     struct std::forward_iterator_tag (base) (empty)
         0 |       struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__false_type (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char> (empty)
         0 |   class __gnu_cxx::new_allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::_Alloc_hider
         0 |   class std::allocator<char> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char[16] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char>
         0 |   struct std::basic_string<char>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char[16] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<wchar_t> (empty)
         0 |   class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::_Alloc_hider
         0 |   class std::allocator<wchar_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   wchar_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<wchar_t>
         0 |   struct std::basic_string<wchar_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<wchar_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<wchar_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     wchar_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char16_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char16_t> (empty)
         0 |   class __gnu_cxx::new_allocator<char16_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::_Alloc_hider
         0 |   class std::allocator<char16_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char16_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char16_t[8] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char16_t>
         0 |   struct std::basic_string<char16_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char16_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char16_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char16_t[8] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::new_allocator<char32_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char32_t> (empty)
         0 |   class __gnu_cxx::new_allocator<char32_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::_Alloc_hider
         0 |   class std::allocator<char32_t> (base) (empty)
         0 |     class __gnu_cxx::new_allocator<char32_t> (base) (empty)
         0 |   pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7)
         0 |   char32_t[4] _M_local_buf
         0 |   size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char32_t>
         0 |   struct std::basic_string<char32_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char32_t> (base) (empty)
         0 |       class __gnu_cxx::new_allocator<char32_t> (base) (empty)
         0 |     pointer _M_p
         8 |   size_type _M_string_length
        16 |   union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/basic_string.h:179:7) 
        16 |     char32_t[4] _M_local_buf
        16 |     size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale
         0 |   _Impl * _M_impl
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::facet
         0 |   (facet vtable pointer)
         8 |   _Atomic_word _M_refcount
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::_Impl
         0 |   _Atomic_word _M_refcount
         8 |   const facet ** _M_facets
        16 |   size_t _M_facets_size
        24 |   const facet ** _M_caches
        32 |   char ** _M_names
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::id
         0 |   size_t _M_index
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const class std::error_category *> (empty)
         0 |   struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::error_category
         0 |   (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::error_code
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::error_condition
         0 |   int _M_value
         8 |   const error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5)
         0 |   const char * _M_p
         0 |   char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cow_string
         0 |   union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         0 |     const char * _M_p
         0 |     char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::runtime_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   struct std::__cow_string _M_msg
         8 |     union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         8 |       const char * _M_p
         8 |       char[8] _M_bytes
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::system_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     struct std::__cow_string _M_msg
         8 |       union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdexcept:50:5) 
         8 |         const char * _M_p
         8 |         char[8] _M_bytes
        16 |   struct std::error_code _M_code
        16 |     int _M_value
        24 |     const error_category * _M_cat
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Words
         0 |   void * _M_pword
         8 |   long _M_iword
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base
         0 |   (ios_base vtable pointer)
         8 |   streamsize _M_precision
        16 |   streamsize _M_width
        24 |   fmtflags _M_flags
        28 |   iostate _M_exception
        32 |   iostate _M_streambuf_state
        40 |   _Callback_list * _M_callbacks
        48 |   struct std::ios_base::_Words _M_word_zero
        48 |     void * _M_pword
        56 |     long _M_iword
        64 |   _Words[8] _M_local_word
       192 |   int _M_word_size
       200 |   _Words * _M_word
       208 |   class std::locale _M_ios_locale
       208 |     _Impl * _M_impl
           | [sizeof=216, dsize=216, align=8,
           |  nvsize=216, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ctype_base (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ctype<char>
         0 |   class std::locale::facet (primary base)
         0 |     (facet vtable pointer)
         8 |     _Atomic_word _M_refcount
         0 |   struct std::ctype_base (base) (empty)
        16 |   __c_locale _M_c_locale_ctype
        24 |   _Bool _M_del
        32 |   __to_type _M_toupper
        40 |   __to_type _M_tolower
        48 |   const mask * _M_table
        56 |   char _M_widen_ok
        57 |   char[256] _M_widen
       313 |   char[256] _M_narrow
       569 |   char _M_narrow_ok
           | [sizeof=576, dsize=570, align=8,
           |  nvsize=570, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::allocator<char> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Callback_list
         0 |   _Callback_list * _M_next
         8 |   class ios_base::event_callback _M_fn
        16 |   int _M_index
        20 |   _Atomic_word _M_refcount
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ios<char>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     streamsize _M_precision
        16 |     streamsize _M_width
        24 |     fmtflags _M_flags
        28 |     iostate _M_exception
        32 |     iostate _M_streambuf_state
        40 |     _Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     _Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     _Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       _Impl * _M_impl
       216 |   basic_ostream<char, char_traits<char> > * _M_tie
       224 |   char_type _M_fill
       225 |   _Bool _M_fill_init
       232 |   basic_streambuf<char, char_traits<char> > * _M_streambuf
       240 |   const __ctype_type * _M_ctype
       248 |   const __num_put_type * _M_num_put
       256 |   const __num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   streamsize _M_gcount
        16 |   class std::basic_ios<char> (virtual base)
        16 |     class std::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       streamsize _M_precision
        32 |       streamsize _M_width
        40 |       fmtflags _M_flags
        44 |       iostate _M_exception
        48 |       iostate _M_streambuf_state
        56 |       _Callback_list * _M_callbacks
        64 |       struct std::ios_base::_Words _M_word_zero
        64 |         void * _M_pword
        72 |         long _M_iword
        80 |       _Words[8] _M_local_word
       208 |       int _M_word_size
       216 |       _Words * _M_word
       224 |       class std::locale _M_ios_locale
       224 |         _Impl * _M_impl
       232 |     basic_ostream<char, char_traits<char> > * _M_tie
       240 |     char_type _M_fill
       241 |     _Bool _M_fill_init
       248 |     basic_streambuf<char, char_traits<char> > * _M_streambuf
       256 |     const __ctype_type * _M_ctype
       264 |     const __num_put_type * _M_num_put
       272 |     const __num_get_type * _M_num_get
           | [sizeof=280, dsize=280, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ios<wchar_t>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     streamsize _M_precision
        16 |     streamsize _M_width
        24 |     fmtflags _M_flags
        28 |     iostate _M_exception
        32 |     iostate _M_streambuf_state
        40 |     _Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     _Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     _Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       _Impl * _M_impl
       216 |   basic_ostream<wchar_t, char_traits<wchar_t> > * _M_tie
       224 |   char_type _M_fill
       228 |   _Bool _M_fill_init
       232 |   basic_streambuf<wchar_t, char_traits<wchar_t> > * _M_streambuf
       240 |   const __ctype_type * _M_ctype
       248 |   const __num_put_type * _M_num_put
       256 |   const __num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_istream<wchar_t>
         0 |   (basic_istream vtable pointer)
         8 |   streamsize _M_gcount
        16 |   class std::basic_ios<wchar_t> (virtual base)
        16 |     class std::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       streamsize _M_precision
        32 |       streamsize _M_width
        40 |       fmtflags _M_flags
        44 |       iostate _M_exception
        48 |       iostate _M_streambuf_state
        56 |       _Callback_list * _M_callbacks
        64 |       struct std::ios_base::_Words _M_word_zero
        64 |         void * _M_pword
        72 |         long _M_iword
        80 |       _Words[8] _M_local_word
       208 |       int _M_word_size
       216 |       _Words * _M_word
       224 |       class std::locale _M_ios_locale
       224 |         _Impl * _M_impl
       232 |     basic_ostream<wchar_t, char_traits<wchar_t> > * _M_tie
       240 |     char_type _M_fill
       244 |     _Bool _M_fill_init
       248 |     basic_streambuf<wchar_t, char_traits<wchar_t> > * _M_streambuf
       256 |     const __ctype_type * _M_ctype
       264 |     const __num_put_type * _M_num_put
       272 |     const __num_get_type * _M_num_get
           | [sizeof=280, dsize=280, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base::Init (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fe9cf618[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:626:5[0m, [0;33mline:641:5[0m> [0;33mline:626:11[0m referenced class[0;1;36m Init[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fe9cf738[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x55c9fe9cf820[0m <[0;33mline:628:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x55c9fe9cf860[0m <[0;33mline:629:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fe9cf8f8[0m <[0;33mline:630:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m used[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x55c9fe9cfa28[0m <[0;33mline:631:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m used[0;1;36m ~Init[0m [0;32m'void () noexcept'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fe9cfca0[0m <[0;33mline:634:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const Init &)'[0m default trivial noexcept-unevaluated 0x55c9fe9cfca0 implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fe9cfb98[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const Init &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fe9cfef8[0m <[0;33mline:635:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'Init &(const Init &)'[0m default trivial noexcept-unevaluated 0x55c9fe9cfef8 implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fe9cfd80[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const Init &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x55c9fe9cffa8[0m <[0;33mline:638:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x55c9fe9cffe0[0m <[0;33mline:639:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x55c9fe9d0058[0m <[0;33mline:640:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base::Init" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::ios_base::Init.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__concurrence_lock_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__concurrence_unlock_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__concurrence_broadcast_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__concurrence_wait_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__mutex
         0 |   pthread_mutex_t _M_mutex
         0 |     struct __pthread_mutex_s __data
         0 |       int __lock
         4 |       unsigned int __count
         8 |       int __owner
        12 |       unsigned int __nusers
        16 |       int __kind
        20 |       short __spins
        22 |       short __elision
        24 |       struct __pthread_internal_list __list
        24 |         struct __pthread_internal_list * __prev
        32 |         struct __pthread_internal_list * __next
         0 |     char[40] __size
         0 |     long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__recursive_mutex
         0 |   pthread_mutex_t _M_mutex
         0 |     struct __pthread_mutex_s __data
         0 |       int __lock
         4 |       unsigned int __count
         8 |       int __owner
        12 |       unsigned int __nusers
        16 |       int __kind
        20 |       short __spins
        22 |       short __elision
        24 |       struct __pthread_internal_list __list
        24 |         struct __pthread_internal_list * __prev
        32 |         struct __pthread_internal_list * __next
         0 |     char[40] __size
         0 |     long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::in_place_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::_Swallow_assign (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::bad_weak_ptr
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class __gnu_cxx::__scoped_lock
         0 |   __mutex_type & _M_device
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Mutex_base<__gnu_cxx::_S_atomic> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_base<>
         0 |   (_Sp_counted_base vtable pointer)
         0 |   class std::_Mutex_base<__gnu_cxx::_S_atomic> (base) (empty)
         8 |   _Atomic_word _M_use_count
        12 |   _Atomic_word _M_weak_count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Mutex_base<__gnu_cxx::_S_single> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_base<__gnu_cxx::_S_single>
         0 |   (_Sp_counted_base vtable pointer)
         0 |   class std::_Mutex_base<__gnu_cxx::_S_single> (base) (empty)
         8 |   _Atomic_word _M_use_count
        12 |   _Atomic_word _M_weak_count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_ptr<nullptr_t, __gnu_cxx::_S_single>
         0 |   class std::_Sp_counted_base<__gnu_cxx::_S_single> (primary base)
         0 |     (_Sp_counted_base vtable pointer)
         0 |     class std::_Mutex_base<__gnu_cxx::_S_single> (base) (empty)
         8 |     _Atomic_word _M_use_count
        12 |     _Atomic_word _M_weak_count
        16 |   nullptr_t _M_ptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Mutex_base<_S_mutex>
         0 |   class __gnu_cxx::__mutex (base)
         0 |     pthread_mutex_t _M_mutex
         0 |       struct __pthread_mutex_s __data
         0 |         int __lock
         4 |         unsigned int __count
         8 |         int __owner
        12 |         unsigned int __nusers
        16 |         int __kind
        20 |         short __spins
        22 |         short __elision
        24 |         struct __pthread_internal_list __list
        24 |           struct __pthread_internal_list * __prev
        32 |           struct __pthread_internal_list * __next
         0 |       char[40] __size
         0 |       long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_base<__gnu_cxx::_S_mutex>
         0 |   (_Sp_counted_base vtable pointer)
         8 |   class std::_Mutex_base<_S_mutex> (base)
         8 |     class __gnu_cxx::__mutex (base)
         8 |       pthread_mutex_t _M_mutex
         8 |         struct __pthread_mutex_s __data
         8 |           int __lock
        12 |           unsigned int __count
        16 |           int __owner
        20 |           unsigned int __nusers
        24 |           int __kind
        28 |           short __spins
        30 |           short __elision
        32 |           struct __pthread_internal_list __list
        32 |             struct __pthread_internal_list * __prev
        40 |             struct __pthread_internal_list * __next
         8 |         char[40] __size
         8 |         long __align
        48 |   _Atomic_word _M_use_count
        52 |   _Atomic_word _M_weak_count
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_ptr<nullptr_t, __gnu_cxx::_S_mutex>
         0 |   class std::_Sp_counted_base<__gnu_cxx::_S_mutex> (primary base)
         0 |     (_Sp_counted_base vtable pointer)
         8 |     class std::_Mutex_base<_S_mutex> (base)
         8 |       class __gnu_cxx::__mutex (base)
         8 |         pthread_mutex_t _M_mutex
         8 |           struct __pthread_mutex_s __data
         8 |             int __lock
        12 |             unsigned int __count
        16 |             int __owner
        20 |             unsigned int __nusers
        24 |             int __kind
        28 |             short __spins
        30 |             short __elision
        32 |             struct __pthread_internal_list __list
        32 |               struct __pthread_internal_list * __prev
        40 |               struct __pthread_internal_list * __next
         8 |           char[40] __size
         8 |           long __align
        48 |     _Atomic_word _M_use_count
        52 |     _Atomic_word _M_weak_count
        56 |   nullptr_t _M_ptr
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::_Sp_counted_ptr<nullptr_t, __gnu_cxx::_S_atomic>
         0 |   class std::_Sp_counted_base<> (primary base)
         0 |     (_Sp_counted_base vtable pointer)
         0 |     class std::_Mutex_base<__gnu_cxx::_S_atomic> (base) (empty)
         8 |     _Atomic_word _M_use_count
        12 |     _Atomic_word _M_weak_count
        16 |   nullptr_t _M_ptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__atomic_flag_base
         0 |   __atomic_flag_data_type _M_i
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::atomic_flag
         0 |   struct std::__atomic_flag_base (base)
         0 |     __atomic_flag_data_type _M_i
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class __pstl::execution::sequenced_policy (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class __pstl::execution::parallel_policy (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class __pstl::execution::parallel_unsequenced_policy (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class __pstl::execution::unsequenced_policy (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class Foo
         0 |   (Foo vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::basic_ios<char> (virtual base)
         8 |     class std::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       streamsize _M_precision
        24 |       streamsize _M_width
        32 |       fmtflags _M_flags
        36 |       iostate _M_exception
        40 |       iostate _M_streambuf_state
        48 |       _Callback_list * _M_callbacks
        56 |       struct std::ios_base::_Words _M_word_zero
        56 |         void * _M_pword
        64 |         long _M_iword
        72 |       _Words[8] _M_local_word
       200 |       int _M_word_size
       208 |       _Words * _M_word
       216 |       class std::locale _M_ios_locale
       216 |         _Impl * _M_impl
       224 |     basic_ostream<char, char_traits<char> > * _M_tie
       232 |     char_type _M_fill
       233 |     _Bool _M_fill_init
       240 |     basic_streambuf<char, char_traits<char> > * _M_streambuf
       248 |     const __ctype_type * _M_ctype
       256 |     const __num_put_type * _M_num_put
       264 |     const __num_get_type * _M_num_get
           | [sizeof=272, dsize=272, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class ChildFoo
         0 |   class Foo (primary base)
         0 |     (Foo vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fefaa0a8[0m <[0;33mcheck_vptr.cpp:15:1[0m, [0;33mline:21:1[0m> [0;33mline:15:7[0m referenced class[0;1;36m Foo[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fefaa1c8[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit referenced class[0;1;36m Foo[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x55c9fefaa258[0m <[0;33mline:16:1[0m, [0;33mcol:8[0m> [0;33mcol:1[0m private
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x55c9fefaa280[0m <[0;33mline:18:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fefaa300[0m <[0;33mline:19:5[0m, [0;33mcol:53[0m> [0;33mcol:18[0m used[0;1;36m foo[0m [0;32m'void ()'[0m virtual implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55c9fefb0f30[0m <[0;33mcol:24[0m, [0;33mcol:53[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x55c9fefb0ef8[0m <[0;33mcol:25[0m, [0;33mcol:38[0m> [0;32m'basic_ostream<char, char_traits<char>>':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<' adl
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55c9fefb0ee0[0m <[0;33mcol:35[0m> [0;32m'basic_ostream<char, char_traits<char>> &(*)(basic_ostream<char, char_traits<char>> &, const char *)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55c9fefb0e60[0m <[0;33mcol:35[0m> [0;32m'basic_ostream<char, char_traits<char>> &(basic_ostream<char, char_traits<char>> &, const char *)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55c9feb722f0[0m[0;1;36m 'operator<<'[0m [0;32m'basic_ostream<char, char_traits<char>> &(basic_ostream<char, char_traits<char>> &, const char *)'[0m
[0;34m|     |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55c9fefaa8a8[0m <[0;33mcol:25[0m, [0;33mcol:30[0m> [0;32m'ostream':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x55c9fec08d70[0m[0;1;36m 'cout'[0m [0;32m'ostream':'std::basic_ostream<char>'[0m
[0;34m|     | `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x55c9fef9a4d8[0m[0;1;36m 'std'[0m
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55c9fefb0e48[0m <[0;33mcol:38[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mArrayToPointerDecay[0m>
[0;34m|       `-[0m[0;1;35mStringLiteral[0m[0;33m 0x55c9fefaa960[0m <[0;33mcol:38[0m> [0;32m'const char[12]'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "Foo->foo()\n"[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x55c9fefaa428[0m <[0;33mline:20:5[0m, [0;33mcol:28[0m> [0;33mcol:13[0m used[0;1;36m ~Foo[0m [0;32m'void () noexcept'[0m virtual default implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55c9fefbcbb8[0m <[0;33mcol:28[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fefaa5e0[0m <[0;33mline:15:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'Foo &(const Foo &)'[0m inline default noexcept-unevaluated 0x55c9fefaa5e0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefaa710[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Foo &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fefb1398[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m Foo[0m [0;32m'void (const Foo &)'[0m inline default noexcept-unevaluated 0x55c9fefb1398
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefb14d0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Foo &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fefbc768[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit used constexpr[0;1;36m Foo[0m [0;32m'void () noexcept'[0m inline default
[0;34m  `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55c9fefbc868[0m <[0;33mcol:7[0m>

Layout: <CGRecordLayout
  LLVMType:%class.Foo = type { ptr }
  NonVirtualBaseLLVMType:%class.Foo = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fefb0f48[0m <[0;33mcheck_vptr.cpp:24:1[0m, [0;33mline:28:1[0m> [0;33mline:24:7[0m referenced class[0;1;36m ChildFoo[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple non_trivial needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple non_trivial needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m simple non_trivial needs_overload_resolution
[0;34m|-[0mpublic [0;32m'Foo'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fefb10a8[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit class[0;1;36m ChildFoo[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x55c9fefb1138[0m <[0;33mline:25:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fefb11b0[0m <[0;33mline:27:5[0m, [0;33mcol:67[0m> [0;33mcol:18[0m[0;1;36m foo[0m [0;32m'void ()'[0m virtual implicit-inline
[0;34m| |-[0mOverrides: [ 0x55c9fefaa300 Foo::foo 'void ()' ]
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55c9fefbc5a8[0m <[0;33mcol:33[0m, [0;33mcol:67[0m>
[0;34m| | `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x55c9fefbc570[0m <[0;33mcol:34[0m, [0;33mcol:47[0m> [0;32m'basic_ostream<char, char_traits<char>>':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<' adl
[0;34m| |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55c9fefbc558[0m <[0;33mcol:44[0m> [0;32m'basic_ostream<char, char_traits<char>> &(*)(basic_ostream<char, char_traits<char>> &, const char *)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55c9fefbc538[0m <[0;33mcol:44[0m> [0;32m'basic_ostream<char, char_traits<char>> &(basic_ostream<char, char_traits<char>> &, const char *)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x55c9feb722f0[0m[0;1;36m 'operator<<'[0m [0;32m'basic_ostream<char, char_traits<char>> &(basic_ostream<char, char_traits<char>> &, const char *)'[0m
[0;34m| |   |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x55c9fefba418[0m <[0;33mcol:34[0m, [0;33mcol:39[0m> [0;32m'ostream':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x55c9fec08d70[0m[0;1;36m 'cout'[0m [0;32m'ostream':'std::basic_ostream<char>'[0m
[0;34m| |   | `-[0mNestedNameSpecifier [0;1;32mNamespace[0m[0;33m 0x55c9fef9a4d8[0m[0;1;36m 'std'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x55c9fefbc520[0m <[0;33mcol:47[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mArrayToPointerDecay[0m>
[0;34m| |     `-[0m[0;1;35mStringLiteral[0m[0;33m 0x55c9fefba448[0m <[0;33mcol:47[0m> [0;32m'const char[17]'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "ChildFoo->foo()\n"[0m
[0;34m| `-[0m[0;1;34mOverrideAttr[0m[0;33m 0x55c9fefb1290[0m <[0;33mcol:24[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fefb1558[0m <[0;33mline:24:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m ChildFoo[0m [0;32m'void (const ChildFoo &)'[0m inline default noexcept-unevaluated 0x55c9fefb1558
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefb1690[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const ChildFoo &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fefb1760[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m ChildFoo[0m [0;32m'void (ChildFoo &&)'[0m inline default noexcept-unevaluated 0x55c9fefb1760
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefb1890[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'ChildFoo &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fefb9eb0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'ChildFoo &(const ChildFoo &)'[0m inline default noexcept-unevaluated 0x55c9fefb9eb0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefb9fe0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const ChildFoo &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x55c9fefba050[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'ChildFoo &(ChildFoo &&)'[0m inline default noexcept-unevaluated 0x55c9fefba050
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x55c9fefba180[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'ChildFoo &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x55c9fefba218[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~ChildFoo[0m [0;32m'void () noexcept'[0m inline default
[0;34m| `-[0mOverrides: [ 0x55c9fefaa428 Foo::~Foo 'void () noexcept' ]
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x55c9fefbca60[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit used constexpr[0;1;36m ChildFoo[0m [0;32m'void () noexcept'[0m inline default
[0;34m  |-[0mCXXCtorInitializer [0;32m'Foo'[0m
[0;34m  | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x55c9fefbcb58[0m <[0;33mcol:7[0m> [0;32m'Foo'[0m[0;36m[0m[0;36m[0m [0;32m'void () noexcept'[0m
[0;34m  `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x55c9fefbcbc8[0m <[0;33mcol:7[0m>

Layout: <CGRecordLayout
  LLVMType:%class.ChildFoo = type { %class.Foo }
  NonVirtualBaseLLVMType:%class.ChildFoo = type { %class.Foo }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<int, int> (empty)
         0 |   struct std::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<float, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x55c9fe9ce940[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h:592:5[0m, [0;33mline:597:5[0m> [0;33mline:592:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
